[
  {
    "id": "7281773524602564608",
    "author": "jes***a-s***ife*********8",
    "content": "2024 was a year filled with challenges, firsts, and growth. I’m so thankful for all the people I got to share it with, all our partners who share in our mission and supporting sustainability and our co-founders Kimberly Reilly & Megan Hayes for creating Everybody Water . The joy is in who you share it with 💙 #waterwithaheart",
    "timestamp": "2025-01-05T20:48:17.043Z",
    "matched_at": "2025-03-16T14:03:06.299228"
  },
  {
    "id": "7282040866708287488",
    "author": "mic***laf***nti***",
    "content": "🐝 I’m deeply honored to share that I’m stepping into the role of Chief Product Officer at Bumble Inc. ! This is more than just a professional milestone for me - I’ve always been passionate about creating products that help people connect and build meaningful relationships, and I can’t think of a better place to carry on this work than at Bumble. I believe that technology can help us solve human problems in many untapped ways. I actually met my wife Sara online, so I have a profound appreciation for how tech products can facilitate online introductions that end up changing the course of our lives in incredibly meaningful ways - so Bumble’s goal to redefine online to real world connections to help people find real, authentic relationships couldn’t be more exciting to me. The company’s mission and determination to lead with its values of kindness, respect and equality to drive healthy relationships resonates with me deeply, and I’m excited to help shape the future of Bumble’s product experience alongside such a talented team. Over the last two decades working in both consumer and enterprise organizations, I’ve learned the power of customer-centric innovation, experimentation, and exceptional design. Most recently at Salesforce, I had the privilege of working with some of the world’s leading brands to create transformative e-commerce solutions. Now, I’m looking forward to bringing those insights to Bumble as we continue building products that truly make a difference. I’m energized by the vision and pace of innovation set by Lidiane Jones , so here’s to an exciting new chapter - I can’t wait to get started! 💛",
    "timestamp": "2025-01-06T14:30:36.368Z",
    "matched_at": "2025-03-16T14:03:06.299239"
  },
  {
    "id": "7287617649751007232",
    "author": "jor***-m-***ers*********",
    "content": "What a remarkable week it has been at the United States Conference of Mayors Winter Meeting! The Axon Government Affairs team had the privilege to participate and sponsor this significant event, engaging with city leaders on crucial topics such as AI, public safety, and emerging technology. The sessions on utilizing AI to enhance public trust, combating gun violence, and tackling cybersecurity challenges were truly insightful, highlighting Axon's pioneering efforts in advancing innovation to bolster safer and more resilient communities. The opportunity to listen to President Biden one last time and join the closing reception at the Embassy of Spain's private residence was truly an honor. The connections made with exceptional individuals and cherished industry colleagues added an extra layer of significance to this week. Here's to fostering ongoing dialogues and establishing partnerships that drive substantial transformation! #USCM #PublicSafety #Innovation #Axon #CityLeadership #governmentaffairs Donovan Pepper , Laken Ferreira O'Brien , Michael E. , Tish Maes , Alberto Garcia , Danielle D'Alessandro .",
    "timestamp": "2025-01-21T23:50:45.071Z",
    "matched_at": "2025-03-16T14:03:06.299240"
  },
  {
    "id": "7264174795619983361",
    "author": "******",
    "content": "Will OpenAI's 'Operator' AI agent be a game-changer in digital interaction? OpenAI claims it will be revolutionising the way we interact with technology with its upcoming AI agent, 'Operator.' This innovative tool is designed to work autonomously, taking over repetitive tasks and allowing us to focus on what truly matters. Could this be the next big leap in AI, transforming how we work and connect? How does it differ from its competition? OpenAI is not revealing anything new compared to its rivals, who've already announced their upcoming launches or even previews of their similar solutions. ⚡ 'Operator' is anticipated to launch as a research preview and developer tool by January 2025. This means we'll have to wait for quite some time for an open release, with a delayed EU launch for sure. ⚡ The AI agent will automate routine tasks, enhance web browsing experiences, and optimise online interactions. 'Operator' can help with everyday tasks like booking meetings, ordering food, managing travel arrangements, or even handling routine customer queries—aiming to simplify and enhance daily life. ⚡ With players like Anthropic , Microsoft , and Google all entering the arena with similar offerings, the race to perfect autonomous AI agents is heating up, signalling a broader shift in how digital assistants will shape our future. ⚡ Tools like 'Operator' could unlock new efficiencies, enabling professionals to prioritise strategic and creative endeavours while repetitive tasks are handled in the background. How do you think AI agents like 'Operator' will transform customer and employee experiences in the years to come? Share your thoughts in the comments and join the conversation! #AI #CX #Shirute #MachineCustomers #DigitalAssistants #tekoäly #koneasiakkaat #CXPAFinland #CustomerExperience #asiakaskokemus",
    "timestamp": "2024-11-18T07:17:13.097Z",
    "matched_at": "2025-03-16T14:03:06.299241"
  },
  {
    "id": "7285968600207683584",
    "author": "adi***rry***",
    "content": "🚀 Just wrapped up two incredible days at the Public Sector Executive Summit: Generative AI and the Future City at Harvard University . It was inspiring to be surrounded by many visionary city and county leaders, all rethinking how to better serve their communities. Big thanks to David Graham and Dr. David S. Ricketts for organizing such an outstanding event and for inviting me to be part of it. I had the honor of speaking on a panel with Erik Caldwell and Jennifer Sanders about The Future of Engagement & Thriving Communities, where I shared two case studies on how the with Community Hub s platform is helping the City of Aurora, IL, and Jasper County, IA, build stronger, more connected communities. Seeing how excited people were about what we’re doing was a big moment for me! Now for the fun stuff: During the Peer Learning Workout Session, brilliantly led by Stephanie Wade and Michael Baskin , my team ( Angie O'Brien , David Calder , Augustine Boateng , and me) crushed it in the Marshmallow Challenge. We built the tallest structure using only marshmallows and spaghetti sticks! A little creativity, teamwork, and friendly competition go a long way. 💪 The dinner at the Harvard Museum of Natural History was another standout moment. Shoutout to Joshua Baron, for making it extra fun by getting everyone to share their favorite karaoke songs, albums, and concerts. Oh, and yes, we survived the freezing Harvard University tour at 21°F (-6°C)! ❄️ Key Takeaways: 1️⃣ AI isn’t the future! it’s right now. We need to leverage it in every aspect of what we do. 2️⃣ Invest in learning and experimenting. If we want to get it right, we need to invest in learning and experimenting with AI across the board. 3️⃣ Cross-disciplinary collaboration and the build-measure-learn feedback loop are still the fastest way to solve real problems. Whether it’s the Marshmallow Challenge or the Harvard case study on Chilean Mining, this method always gets results. At With, we’re living these lessons every day, helping cities and counties connect with their communities better. This summit reminded me why I’m so proud of the work we do and the incredible people I get to do it with. Step by step, we’re making it happen. 🌟 #CentralizedCalendar #CityManager #CountyManager #GovTech #AI #CommunityEngagement #FutureOfCities #Leadership #Innovation #Harvard #LocalGovernment",
    "timestamp": "2025-01-17T10:38:01.020Z",
    "matched_at": "2025-03-16T14:03:06.299242"
  },
  {
    "id": "7198368590578819072",
    "author": "jlz***er",
    "content": "In a recent visit to one of Microsoft ’s cutting-edge quantum labs, Dr. Dominic Walliman (Domain of Science YouTube channel) had the opportunity to see firsthand and learn about the innovative strides we’re making in quantum computing. During his visit, he met with several of our quantum experts—Drs. Krysta Svore , Lauri Sainiemi , and Chetan Nayak —to delve into the details of Microsoft’s topological quantum computing approach. This method stands out in the quantum realm for its potential to pave the way for a scalable, fault-tolerant quantum supercomputer, that will revolutionize computing as we know it. In this video, Dominic provides a visual explanation of this approach and the science behind it in his highly educational and graphic style. Watch now: https://lnkd.in/gCqwVMmU #AzureQuantum #QuantumComputing #TopologicalQubits",
    "timestamp": "2024-05-20T17:06:51.186Z",
    "matched_at": "2025-03-16T14:03:06.299242"
  },
  {
    "id": "7291016295565737984",
    "author": "******",
    "content": "2025: Our Transformative Journey Has Begun! What an electrifying Sales Kickoff we've wrapped up! With 275 leaders brought together from across the globe in Los Angeles, we shared experiences, journeys, and challenges that governments worldwide are navigating. Being a government leader is challenging, and community expectations are evolving rapidly. Granicus has recognized this, guiding governments through cutting-edge technology and our portfolio of Experience Services through multichannel service delivery for Government’s continuous improvement. Not to forget Our Government Experience Cloud (GXC)! Our mission: Help governments engage constituents transparently, trustworthily, and with personalized services. Our CEO Mark Hynes and Chief Product Officer Bob Ainsbury revealed our behind-the-scenes work in 2024. We're leveraging AI innovation responsibly and innovatively, unlocking government-specific use cases for efficiency while maintaining strict security standards. We're not just changing technology - we're reimagining how governments connect with their communities, guiding them beyond technological solutions. Government, 2025 will be a year of transformation through Granicus! 2025: Our Transformative Journey has begun. Amir Capriles Gabriele \"G\" Masili Bob Ainsbury Suzanne Bottari Behrens Jordan Copland Ian Roberts Nelson C. Daniel Lean Pavneesh Gupta Juan Pablo Gonzalez Rodriguez Angy Peterson Jake Sager Candace Taber Alyssa Starman Cindy Simonides Samantha Chambers Roman Sirotin Andi Stewart Granicus Australia / New Zealand Granicus",
    "timestamp": "2025-01-31T08:55:45.362Z",
    "matched_at": "2025-03-16T14:03:06.299243"
  },
  {
    "id": "7206604682704658432",
    "author": "rag***ath***uva******",
    "content": "Quantum computers are slowly moving from laboratories to High performance computing centers. This movement enables large-scale deployments, greater access to the technology, and deep integration into HPC in the form of quantum acceleration. But there is still some work to be done: To deliver the best performance, one of the key areas of great significance is to establish a standardized and automatic calibration process along with standards for quantum computing performance. Our latest technical paper by X. Deng, S. Pogorzalek, F. Vigneau, P. Yang, M. Schulz and L. Schulz, looks into this topic in detail and outlines the challenges and the way forward. What do you think? IQM Quantum Computers",
    "timestamp": "2024-06-12T10:34:08.565Z",
    "matched_at": "2025-03-16T14:03:06.299244"
  },
  {
    "id": "7288347190408663040",
    "author": "******",
    "content": "While reviewing our survey data, I came across this gem. Our CX Team works hand-in-hand with Logistics to maintain a weekly \"At Risk\" shipments list. We proactively reach out to customers on this list to check on their orders - sometimes packages have already been delivered, other times they're somewhere in the ether! A little bit of effort can go a long way and reward you in the form of one of my favorite surveys we've ever received 🤣 Shoutout to Kristina Khomutova ! 🌟",
    "timestamp": "2025-01-24T00:09:41.104Z",
    "matched_at": "2025-03-16T14:03:06.299245"
  },
  {
    "id": "7123764385629556736",
    "author": "sam***ti-***tta*********036******",
    "content": "Had a great fireside chat at Stripe HQ yesterday with CTO David Singleton and CMO Jeff Titterton where we discussed how fast, affordable, and clean waterborne transportation could be a game changer for the greater Bay Area. It offers solutions to the key issues plaguing the Bay including the housing crisis, traffic congestion, and the post pandemic return to the office. For instance, the commute from Alameda to Oyster Point/South SF (which has about 200 companies) typically takes about 1 hour and 15 minutes, but it's less than 15 minutes on N30. A similar fast commute can be achieved to Redwood City. This not only saves massive amount of time for those already commuting these routes but suddenly enables companies in these tech hubs to tap into a larger talent pool located “far away” from traditional commuting perspective. Employees can now choose to live in areas with more spacious and affordable family housing options, all within a reasonable commute. While I remain optimistic about eventual emergence of flying cars and other innovations, I believe it's crucial to address the existing challenges in the Bay Area with practical solutions we have available today, such as clean and efficient water taxis/ shuttles with low operational costs. As they say, build something that people needs. Not doing that is a disservice to this incredible city. Thanks for having me, Stripe ! (And we are a very happy user at Navier !) #twilightatOP",
    "timestamp": "2023-10-27T20:16:22.651Z",
    "matched_at": "2025-03-16T14:03:06.299245"
  },
  {
    "id": "7204059416348745728",
    "author": "and***-it***nto***",
    "content": "I'm pleased to announce that I have passed the Introduction to Generative AI Learning Path specialization from Google! As an AI enthusiast and digital skills tutor, I continually strive to deepen my knowledge and stay at the forefront of industry trends and practices. With this qualification, I've gained advanced insights into the foundations of large language models (LLMs), their diverse applications, and the ethical considerations crucial for responsible AI development and deployment. #GenerativeAI #AI #Learning #ProfessionalDevelopment #EthicalAI #AIEducation #LLMs #TechEducation",
    "timestamp": "2024-06-05T10:00:09.741Z",
    "matched_at": "2025-03-16T14:03:06.299246"
  },
  {
    "id": "7209910423762911232",
    "author": "sim***anu***",
    "content": "Completed today a short course on building multi AI agent systems with crewAI on DeepLearning.AI Few notes: - crewai - is the name-of-the-game, for developing multi AI agent systems; certainly for quick prototyping and POC/MVP use cases; and moving it to production. Key features I love about it: - Just enough abstraction; focus on your use-case and program flow; not on configuring and developing the support/utility modules/tools to get agents operational. - Ease of use: in less than 100 lines of code you can have a complete content creator agent, that Plan (the content copy) > Researches (the topic for the content) > Writer (actual agent writing the content piece) > Editor (ensures the correctness of grammar, logic, brand match). Thanks João (Joe) Moura @ crewAI and DeepLearning.AI for putting the course together and making it free! Now.... Let's build some agents! https://lnkd.in/exADP3_Y #ai #multiagents #crewai #llm",
    "timestamp": "2024-06-21T13:29:58.656Z",
    "matched_at": "2025-03-16T14:03:06.299247"
  },
  {
    "id": "7291091218803937282",
    "author": "rob***cou***men*********",
    "content": "RE RE RE Help!💥 Appel au réseau! 📣 Maison de Mode contemporaine/ Directeur Retail Monde! ☀️ Paris OU... sud-est ⛱️ (je n'ai pas pu résister au parasol) ☀️ Au sein d'une des plus belles réussites dans l'univers de la Mode ☀️ Poste rattaché au Fondateur, apprécié de tous chez SAPIANCE ! The needs: ☀️Expérience d'une direction retail indispensable MODE ☀️Sur un scope international, indispensable aussi... ☀️ Capacité à accompagner en proximité les relais manageriaux ☀️ Expérience de la montée en puissance de la marque par l'expérience client ☀️ Energie forte, vous savez challenger, animer, embarquer les équipes 📣 Faites passer, tourner, et pour postuler, c'est auprès de la géniale Douce ! Doucevericel@sapiancerh.com",
    "timestamp": "2025-01-31T13:53:28.451Z",
    "matched_at": "2025-03-16T14:03:06.299248"
  },
  {
    "id": "7216126041721892864",
    "author": "gen***cap***lin***",
    "content": "Hi, I’m Genna, and I’m an adaptive athlete. I was born and diagnosed with a mild case of spastic diplegia cerebral palsy, a neurological condition that once made me believe \"athlete\" and \"Genna\" could never be used in the same sentence. A year ago, that all changed when I stepped into a CrossFit-style gym. During my first class, the instructor, now “Coach”, demoed box jumps, a movement where one must jump ridiculously high onto a box. Afterwards, I shamefully whispered to him, “I can’t jump – let alone that high.” He proceeded to bring over a weighted plate and asked me to jump on it. I hesitated, scared to jump without holding on to something. Coach held out his hands, smiled, and said, “Let’s dance.” I began to jump. Each jump was a victory. I was doing it. While I haven’t made it to a box yet, I’m proud to say the height of the plates has gotten taller. #progress While I’m working towards the goal of qualifying for my first competition, I am now faced with a new challenge: losing my job at Pitney Bowes due to a corporate restructure. I’m sad to no longer be part of the PB family after nearly six years, but this loss has brought on an epiphany. It’s time to align my passion for fitness, health, and wellness with my superpowers in social, digital, influencer marketing, and sales enablement, all while being a dedicated disability advocate. I’m asking my network if you recommend any employers in this space or have connections, to please message me. Embracing this new path fills me with excitement and determination. Here’s to new beginnings and welcoming the challenges that make us stronger. 🌟💪 #opentowork #careerpivot #marketing #adaptiveathlete #crossfitjourney",
    "timestamp": "2024-07-08T17:08:37.460Z",
    "matched_at": "2025-03-16T14:03:06.299249"
  },
  {
    "id": "7273196211149377536",
    "author": "par***kho***bar***",
    "content": "It's a wrap! Just finished teaching the last session of the \"Infrastructure Project Development\" course at Stanford University where we explored the fascinating intersection of AI, data centers, and digital infrastructure. Huge thanks to industry experts Mario Sawaya and Kaustubh Pandya for providing a comprehensive overview of the current landscape, emerging trends, and the challenges and opportunities that lie ahead. Grateful for the engaging discussions with our talented students and the valuable insights from all our guest lecturers. #AI #DataCenters #DigitalTransformation #Stanford #infrastructure #sustainability #carbonfree https://lnkd.in/gz3fk5Wm",
    "timestamp": "2024-12-13T04:45:06.153Z",
    "matched_at": "2025-03-16T14:03:06.299249"
  },
  {
    "id": "7288657665713405954",
    "author": "isa***-be***r",
    "content": "OpenAI just released their first ever AI agent, Operator. Julia Pattie 's summary of everything you need to know about AI agents has you covered ⬇️",
    "timestamp": "2025-01-24T20:43:24.187Z",
    "matched_at": "2025-03-16T14:03:06.299250"
  },
  {
    "id": "7282409701336592385",
    "author": "dav***yms***h",
    "content": "Top 10 Toxic Leadership Traits and How to Spot Them While inspiring leadership can bring an organization to new heights, toxic leadership can destroy a company’s momentum. Toxic leaders make it virtually impossible for their teams to succeed. A toxic leader will usually have their own self-interest at heart. How to spot the warning signs of bad leadership, below are ten behaviors that poor leaders might exhibit: 👍 Give this post a thumbs up 💬 Repost to share this with your network ➕ Follow me David Sym-Smith for more Tips Credit: Kevin Box, Forbes, Psychology Today #toxicleadership #leadershipskills #leadershiptraits",
    "timestamp": "2025-01-07T14:56:13.394Z",
    "matched_at": "2025-03-16T14:03:06.299251"
  },
  {
    "id": "7204693057596715008",
    "author": "******",
    "content": "I believe that large language models (LLMs) can effectively function as intelligent state machines. They can manage the entire state cycle, intelligently advise on state transitions, introduce new states when necessary, and handle exceptions or out-of-state situations. This process can be executed in tandem with an agent, allowing the LLM to focus on the more sophisticated tasks of state transition and management. Addressing LLM hallucinations can be accomplished by using a knowledge graph to validate the state transitions. This approach essentially positions LLMs as intelligent workflow engines. At Innovation Hacks AI, our data science teams build systems for customers using LLM agents to achieve a high degree of automation and deliver substantial ROI. Additionally, our research team constantly tracks the latest developments in the community and converts them into frameworks to ensure our customers stay updated with the latest advancements. We are just an email away at sales@innovation-hacks.ai . Innovation Hacks AI #llm #ai #deeplearning #microsoft https://lnkd.in/d2Xryk72",
    "timestamp": "2024-06-07T03:58:01.619Z",
    "matched_at": "2025-03-16T14:03:06.299252"
  },
  {
    "id": "7288966182869602304",
    "author": "wil***mhg***s",
    "content": "My mom was a force—and one of the most generous people I’ve ever known. She dedicated her life to philanthropy and became the first female president of United Way of King County, later serving as board chair of United Way International. I’m proud to donate all the author's proceeds from Source Code to United Way Worldwide in her memory.",
    "timestamp": "2025-01-25T17:09:20.409Z",
    "matched_at": "2025-03-16T14:03:06.299253"
  },
  {
    "id": "7291000825059942401",
    "author": "dag***e",
    "content": "Thanks for having me AI Mad Lab ! Was a blast sharing the stage with Daniel Marchand , and the over 100 talented engineers, researchers, and tinkerers in attendance. This was my first public appearance as the Head of AI at Tana , and I couldn't ask for a more welcome crowd. I hope you enjoyed that fast paced demo, we have so much more to show you. Coming very soon! The mission is still the same: Find interesting problems, and solve them in a magical way. Go build! (And thank you Startuplab and Nissik (Nils) Juell for hosting! The future is bright for startups in Norway with supporters like you!)",
    "timestamp": "2025-01-31T07:54:16.905Z",
    "matched_at": "2025-03-16T14:03:06.299253"
  },
  {
    "id": "7211439101877571585",
    "author": "aha***d-n***z",
    "content": "ConvertirseAI is an advanced code conversion platform powered by LLaMA3 70b, LangChain , and Groq and Streamlit . It leverages state-of-the-art AI to transform code between various programming languages while maintaining code structure and functionality. Features Code Conversion: Convert code snippets from one programming language to another using advanced AI models. Syntax Preservation: Preserve comments and structure during code conversion. Language Support: Currently supports Python, JavaScript, Java, C++, Ruby, Go, Rust, TypeScript, PHP, and Swift. Explanation: Understand the transformation process by explaining key differences between source and target code. Note: ConvertirseAI uses advanced AI for code transformation. Always review and test the transformed code before use. Github: https://lnkd.in/g-2qSia7 #MachineLearning #GenAI #LLM #AI",
    "timestamp": "2024-06-25T18:44:23.933Z",
    "matched_at": "2025-03-16T14:03:06.299254"
  },
  {
    "id": "7218056611439812608",
    "author": "gya***rik***",
    "content": "🔥 𝐓𝐨𝐩 𝐋𝐋𝐌 𝐂𝐨𝐮𝐫𝐬𝐞𝐬 𝐭𝐨 𝐌𝐚𝐬𝐭𝐞𝐫 𝐢𝐧 2024 🚀 Level up your AI game with these must-take courses on Large Language Models (LLMs): 1. 🌟 Master LLM Prompt Engineering 2. 🚀 No-Code AI Applications with Chat GPT & Open AI 3. 🧠 Master LLM Fine-Tuning with Llama3 4. 🐍 Master Vector Database with Python 5. 📈 LLM Alignment & Preference Optimization 6. 🛠️ Haystack: Customisable LLM Pipelines 7. 🔧 Improving LLM Performance Beyond Fine-Tuning 8. 🎓 Chat GPT & Gemini Masterclass 9. ☁️ LLMs with Google Cloud & Python 10. 📚 LLMs Workshop: Practical Exercises Explore these courses from the link below! 🚀🌟 #AI #LLM #MachineLearning #ArtificialIntelligence",
    "timestamp": "2024-07-14T01:00:01.135Z",
    "matched_at": "2025-03-16T14:03:06.299255"
  },
  {
    "id": "7290062659826188289",
    "author": "mro***4",
    "content": "Atlassian and Carahsoft are in the house at AFCEA West 25! Come see see us in the Sails Pavilion at Booth #4213! Colleen Neal, PMP , Bill Canter , Sanyo J. , Soulin Reyes , Carlos Guzman-Portillo #atlassian #afceawest #west25",
    "timestamp": "2025-01-28T17:46:20.884Z",
    "matched_at": "2025-03-16T14:03:06.299256"
  },
  {
    "id": "7185271216423813120",
    "author": "tvv***esh***",
    "content": "We have been playing around with LLMs and GPTs for sometime now experimenting with #RAG , chunking, On-premise and Managed models, and the various vector databases in the market as of today. Here is a quick insight on the potential LLM stack for building the #copilots / LLMs of tomorrow (This is purely a suggestion based on our experience, and the landscape can change over time) - UI for enabling multi-user, multi-modal, context-aware chat with the ability to configure settings as required - Chainlit ( https://lnkd.in/gAhEjK7k ) - A way to manage the documents available and enable ETL to vector stores - Apache Airflow ( https://lnkd.in/g6-JsbjK ) - Document extraction: To enable extraction of text from the documents and even do OCR as required - Fitz from PyMuPDF ( https://lnkd.in/grwNU7y9 ) - Self-Hosted LLM Model: To enable embeddings by converting to vectors, do NLP operations, handle context, etc. - Mixtral-8x7B-v0.1-GGUF ( https://lnkd.in/gvCZcYFY ) from Mistral AI - Vectorstore: To enable storing the embeddings, do similarity search and enable RAG - Milvus ( https://milvus.io/ ) - Orchestration Framework: LangChain ( https://lnkd.in/gGdAueGq ) - Persistence for application/user specific data like chat history, human feedback, etc. - PostgreSQL ( https://lnkd.in/gNGH786z ) - Language for LLMs: Python ( https://www.python.org/ ) While these are my suggestions, there is a very promising article by Andreessen Horowitz here: https://lnkd.in/g5xA6gwF which gives you a great idea about the LLM landscape and you can see the accompanying Github repo giving more details here: https://lnkd.in/g86QE4iE which is more updated. There are various newcomers to this market every day. For instance, I was experimenting with https://lnkd.in/gyDF2BRz yesterday but of course they come with their own challenges being \"newcomers\": https://lnkd.in/gVHQWhsN There is one thing I am very sure of though. #LLMs are going to be everywhere and it is going to make access to information and usability better for everyone within the next year. Wondering what the next trend would be? I predict that it will be on #cybersecurity and #governance considering LLMs are going to need a different kind of security and data governance than the way conventional security/governance systems are structured. Also, considering the vast amounts of data they are trained on, it's very important to have all of them secure and controlled. Looking to have your own copilots done? Reach out to us at team@algoshred.com Virender Aggarwal S S Vadivelan ABHINAV VISWANAATH TV",
    "timestamp": "2024-04-14T13:42:33.849Z",
    "matched_at": "2025-03-16T14:03:06.299256"
  },
  {
    "id": "7203791556082868226",
    "author": "shi***khu***",
    "content": "Today is a HUGE day for team Athina AI (YC W23) . We're finally launching something we've been working on for months - Athina IDE. We first launched Athina almost a year ago as an LLM Observability platform. Over the last 11 months, we've supported hundreds of teams, helping them monitor and evaluate millions of logs in production automatically. After months of feedback and learning, we recognized a critical need for better experimentation. Which brings us to today's launch... 🧪 Athina IDE is a collaborative editor for AI teams to prototype, experiment, and evaluate LLM-powered products 🎯 Core Philosophies 1. Great AI products are a team effort: PMs, Data Scientists, SWEs, MLEs, QA teams, etc., all have to come together to build something great ...so we made sure that non-technical users can experiment, prototype, and run tests on Athina just as easily as technical users. 2. Great AI products are built around great data ... which is why the entire editor revolves around your data and gives you powerful controls like a spreadsheet. 🤔 So what can AI teams do in this editor? 1. Work with Data Like a Spreadsheet: Filter, search, sort, edit, annotate, tag, and delete data with ease. 2. Prototype complex pipelines: Add dynamic columns to run LLM prompts, execute code, make API calls, retrieve data, run transformations and more. 3. Measure AI quality: Run evaluations within the editor itself - there are 50+ preset evaluation metrics or you can create your own custom evals (no-code). 4. Run Experiments: Re-generate datasets with different prompts, models, or retrieval parameters in just a few clicks. Technical users can run more complex experiments programmatically using our SDK. 5. Compare everything side-by-side: Athina IDE has a compare mode where you can compare any number of datasets side-by-side and run evaluations on all of them simultaneously. ⚡️ How Early Users Are Using Athina IDE ⚡️ 1. Testing Transcription Models: One of our early users is using Athina IDE to compare multiple speech-to-text models side-by-side using dynamic columns. 2. Creating Multi-Step Evaluations: Some teams have been creating multi-step evaluations that involve extracting structured data from LLM responses and then running JSON validation rules on it. 3. Comparing Multiple Models: Many teams are running experiments with 5-10 different models, or prompts, or retrievers + a suite of evals at once to determine the best fit for their specific use cases. We’re super excited about this - if you're an AI product builder, we'd love to know what you think! See the link in the comments - our website has some demo videos. Huge shoutout to the team for all the effort that went into making this such a powerful product. Akhil Bisht Vivek Aditya Akshat Gupta Himanshu Bamoria",
    "timestamp": "2024-06-04T16:15:46.915Z",
    "matched_at": "2025-03-16T14:03:06.299257"
  },
  {
    "id": "7245197739876065280",
    "author": "sar***kja***01",
    "content": "🌟 Honored to see my NLP research [ https://lnkd.in/gwQ_iKyS ] referenced in an insightful article by Anthony Alcaraz from Amazon Web Services (AWS) , discussing the \"Emerging Centrality of Agentic RAG.\" 📝 The piece highlights RepoRift and our research on leveraging agentic RAG to overcome challenges in traditional semantic code search. By incorporating context-aware filtering and dynamic information retrieval, RepoRift achieved a 78.2% success rate in retrieving the correct code snippet within the top 10 results, a substantial improvement over previous state-of-the-art systems. This recognition reinforces the importance of innovative approaches in enhancing code search accuracy, and I’m grateful to be contributing to this growing field. 🚀 A big thanks to Anthony Alcaraz for the feature and for driving thought leadership in this space! https://lnkd.in/gjJY4stH Aditya Dora , Ka Seng Sam , Prabhat Singh #AI #GenAI #SemanticSearch #NLP #Innovation #Grateful",
    "timestamp": "2024-09-26T22:29:10.425Z",
    "matched_at": "2025-03-16T14:03:06.299258"
  },
  {
    "id": "7223472604114808832",
    "author": "her***nar***d",
    "content": "#UnderstandingAI , helpful article to grasp most of #AI on an intuitive level. I regularly read the ranting of Gary Marcus against the hype surrounding #LLMs , particularly #ChatGPT - with kind of questioning if he is right or just pissed, that he is not part of the big money game ... With his newest article, he totally got me. THE quote out of it, referencing \"thinking, fast and slow\" of #DanielKahnemann \" #neural #networks , which are good at kind of quick intuition from familiar examples (a la Kahneman’s System I) ... #explicit #symbolic #systems that use formal logic and other reasoning tools (a la Kahneman’s System II). \" https://lnkd.in/e9wWnnWn So my take is - probably different from his conclusion: #LLMs are #highly #useful for humanity, as we as humans can provide the checking of the results quite easily, AND we have to. It's a huge gain in efficiency, but not Artificial General Intelligence ( #AGI ). Use cases abundant. AGI will be solved once we get thinking slow fully aka proofing results from thinking fast with reasoning into systems, AND I assume, we will have to wait some time ; ) It's like driving a #Tesla , which has been selling its #autopilot feature for years, yet you still have to ensure you don't end up in a ditch. Interested in your opinion, Thilo Stadelmann Benjamin F. Grewe Pascal Kaufmann Dr. Marcel Blattner Barbara Weber Andreas Goeldi Myke Näf",
    "timestamp": "2024-07-28T23:41:14.422Z",
    "matched_at": "2025-03-16T14:03:06.299259"
  },
  {
    "id": "7203644158576590848",
    "author": "man***asg***a",
    "content": "Hello Network and Generative AI - RAG Application Development enthusiasts, announcing that I have now launched my second Generative AI RAG Developers Course on Udemy - \"Gen AI - RAG Application Development using LlamaIndex\". As a giveaway, I would like to offer few FREE Coupons to genuinely interested Gen AI developer enthusiasts on a \"first come first serve\" basis. It's a Developer course and the below is the curriculum: 👉 Fundamentals of LLM RAG Application Development 👉 LLM Frameworks with llamaIndex by Meta 👉 Using Open AI GPT and Google's Gemini LLM APIs to develop RAG Applications 👉 Master the art of Prompt Engineering for your RAG 👉 LlamaIndex VectorStore, Retrievers and Query Engines 👉 Building complex Query Pipelines 👉 Multiple RAG Projects with various Source Types and Business Use Please say \"Yes\" in comments or DM me and I'll send you the coupon. Course Link: https://lnkd.in/gbCXKX4n Code4x Teksands.ai #AI #GenAI #generativeAI #LlamaIndex #RAGApplications #RAG #LangChain #OpenAI #OpenAIGPT #GPT4o #LLM",
    "timestamp": "2024-06-04T06:30:04.611Z",
    "matched_at": "2025-03-16T14:03:06.299260"
  },
  {
    "id": "7188963949696954368",
    "author": "she***-ai***",
    "content": "🔥 The last two days have been a whirlwind of Ai-action and fun! 🚀 But here's the bottom line: True AI transformation demands more than just buzzwords. It's about delivering value with measurable ROI, and understanding the risks upfront. That's the secret for successful AI transformation. 💡 🚀 So why haven't 85% of businesses fully embraced AI yet? It boils down to one thing: a lack of AI awareness or understanding of Cloud, data, and AI potential. 📉 And why have 80% of businesses stumbled on the path to AI adoption? It's not for lack of trying, but rather poor AI strategy. Without solid AI management knowledge, even the best intentions falter. 😨 Moreover, why the lingering fear of AI despite its potential? Blame it on the absence of best practices and governance knowledge. 🔑 So, if knowledge is the barrier, then it's time for an AI Knowledge-led transformation! Let's talk about 'real' AI Empowerment, so that you are on the driver's seat! P.s. A huge thanks to all our partners and friends for having us. It was lovely to reconnect and exchange ideas. Let's speak soon. #AI #Empowerment #Transformation #KnowledgeRevolution",
    "timestamp": "2024-04-24T18:16:10.075Z",
    "matched_at": "2025-03-16T14:03:06.299261"
  },
  {
    "id": "7289534965283729409",
    "author": "rob***-ci***iak*********",
    "content": "And then suddenly... In recent days, the frequency of mentions of DeepSeek in the major media headlines has spiked. In the chart below, we use our relative frequency measure with max=100. The latest developments illustrate the constant innovation in the LLM space, with the challenge of how to 'stay on top' when implementing applications within an enterprise - something we highlighted in a post a few weeks ago (with DeepSeek as an example) and how we approach it at Robotic Online Intelligence (ROI) : https://lnkd.in/g7XACwvy #LLMs #AI #intelligentautomation #DeepSeek",
    "timestamp": "2025-01-27T06:49:28.708Z",
    "matched_at": "2025-03-16T14:03:06.299261"
  },
  {
    "id": "7289818913264087040",
    "author": "tom***rsc***",
    "content": "Happy to share I've been hired by HubSpot . It's a sweet compensation package: I pay them for their product and I work for them for free many hours per week just to understand how their product works. My job consists in reading their tutorials, browsing through endless help pages, emailing support, downloading spreadsheets, uploading spreadsheets, finding errors, trying to deduplicate, assigning properties, and on and on and on. They are looking for more free employees. Ping me and happy to refer you!",
    "timestamp": "2025-01-28T01:37:47.176Z",
    "matched_at": "2025-03-16T14:03:06.299262"
  },
  {
    "id": "7208546847877910528",
    "author": "mik***oom***",
    "content": "Three really helpful ways to build AI agents in Relevance AI that aren't ever talked about. Comment if you want a link to the resources as I am building out a huge resource base that isn't public 100% yet. Enjoy! https://lnkd.in/eVxYSJJB",
    "timestamp": "2024-06-17T19:11:36.828Z",
    "matched_at": "2025-03-16T14:03:06.299263"
  },
  {
    "id": "7259414131449999360",
    "author": "ani***sik***",
    "content": "***𝘼𝙋𝙋𝙇𝙄𝘾𝘼𝙏𝙄𝙊𝙉𝙎 𝘼𝙍𝙀 𝘾𝙇𝙊𝙎𝙀𝘿.....𝙏𝙃𝘼𝙉𝙆𝙎 𝙁𝙊𝙍 𝙔𝙊𝙐𝙍 𝘼𝙈𝘼𝙕𝙄𝙉𝙂 𝙍𝙀𝙎𝙋𝙊𝙉𝙎𝙀*** 🌟 Kickstart Your Career with Reliance Industries Limited 's Summer Internship Program 2025! 🌟 Reliance Industries Limited , one of India’s most prestigious conglomerates, is inviting applications for its Summer Internship Program 2025. Here’s your chance to gain hands-on experience and make a real impact! The full-time internship offers a comprehensive learning journey, blending real-world projects, industry insights, and mentorship from experts across various Reliance sectors. 🔹 Roles & Responsibilities Engage in challenging projects, participate in industrial visits, and gain exclusive access to senior leadership. The program includes a powerful induction, a buddy program, and continuous feedback to help shape your career path. 👨🎓 Eligibility Open to students from top business schools and engineering colleges across India. This program offers an unparalleled opportunity to gain industry knowledge and valuable skills. 🎁 Benefits & Perks 1️⃣ Mentorship from industry experts 2️⃣ Face-time with Senior Leadership 3️⃣ Buddy Program for guidance 4️⃣ Robust Assessments & Feedback 5️⃣ Recruitment integration opportunities 📅 Duration: 2 months (Full time) 💸 Stipend: Paid (amount undisclosed) 📌 For more details about the Job Description and Application Link: 1️⃣ Follow Aniket Sikdar 2️⃣ Like this post 3️⃣ Comment your 𝙀𝙈𝘼𝙄𝙇 𝙄𝘿 The official JD and application link will be sent to you via mail by the end of the day. 𝙋𝙇𝙀𝘼𝙎𝙀 𝘿𝙊𝙉'𝙏 𝘿𝙈 𝙈𝙀 for the JD, you'll all get it eventually. So what are you waiting for? Seize this opportunity to build your future with Reliance Industries Limited and gain experience with India’s largest private sector company! #reliance #internship #relianceindustries #summerinternship",
    "timestamp": "2024-11-05T04:00:02.305Z",
    "matched_at": "2025-03-16T14:03:06.299264"
  },
  {
    "id": "7185282571855876096",
    "author": "mar***-ci***-76*********",
    "content": "Title: The LLMentalist Effect: how chat-based Large Language Models replicate the mechanisms of a psychic’s con See… https://lnkd.in/eTtt5WjD (image source) And (from Gary Marcus Marcus)… https://lnkd.in/ehcCpRBz From that post… “… many people are convinced that language models, or specifically chat-based language models, are intelligent. But there isn’t any mechanism inherent in large language models (LLMs) that would seem to enable this and, if real, it would be completely unexplained. LLMs are not brains and do not meaningfully share any of the mechanisms that animals or people use to reason or think. LLMs are a mathematical model of language tokens. You give a LLM text, and it will give you a mathematically plausible response to that text. There is no reason to believe that it thinks or reasons—indeed, every AI researcher and vendor to date has repeatedly emphasised that these models don’t think. There are two possible explanations for this effect: 1/ The tech industry has accidentally invented the initial stages a completely new kind of mind, based on completely unknown principles, using completely unknown processes that have no parallel in the biological world. 2/ The intelligence illusion is in the mind of the user and not in the LLM itself.” ******* PS: it’s most likely based on 2 IMO… “The Psychic’s Con” Related… https://lnkd.in/efGbapED",
    "timestamp": "2024-04-14T14:27:41.185Z",
    "matched_at": "2025-03-16T14:03:06.299265"
  },
  {
    "id": "7232272200597135360",
    "author": "ayu***hau***ia",
    "content": "🔥 GraphRAG: A graph-based RAG framework introduced by Microsoft aims to enhance the traditional RAG framework by constructing a dynamic knowledge graph from a given dataset. 👉 This graph serves as a structured representation of information, capturing not only the data itself but also the relationships and context between different pieces of information. 👉 It works by constructing a dynamic knowledge graph from raw text, capturing essential entities, relationships, and key claims within the data. 👉 However, this added depth comes with higher computational costs, as GraphRAG requires multiple calls to large language models (LLMs), leading to increased token usage. Learn more about use-cases and limitations of this framework in the community writeup on GraphRAG by Akash Desai https://lnkd.in/gSvCnsVB",
    "timestamp": "2024-08-22T06:27:41.723Z",
    "matched_at": "2025-03-16T14:03:06.299265"
  },
  {
    "id": "7289377740024070144",
    "author": "nat***mbe***",
    "content": "DeepSeek app sitting at number 1 overall in the US Iphone App Store is not on my bingo card and is the biggest sign yet that the ChatGPT moat can maybe be cracked. Will continue to cover this and the business of new models on Interconnects AI .",
    "timestamp": "2025-01-26T20:24:43.280Z",
    "matched_at": "2025-03-16T14:03:06.299266"
  },
  {
    "id": "7288103172705816576",
    "author": "ana***vas***z",
    "content": "AI Engineering is 𝘣𝘺 𝘧𝘢𝘳 the most fascinating field for me right now. It leverages a lot of natural language processing and it seems like everyone on LinkedIn and Facebook is talking about it. To know what I’m getting myself into, I tuned into Matt Turck ’𝘀 𝗠𝗔𝗗 𝗣𝗼𝗱𝗰𝗮𝘀𝘁 featuring Chip Huyen . Here are my 5 key takeaways on AI Engineering from the episode: 1️⃣ 𝗧𝗵𝗲 𝗥𝗶𝘀𝗲 𝗼𝗳 𝘁𝗵𝗲 𝗔𝗜 𝗘𝗻𝗴𝗶𝗻𝗲𝗲𝗿 Is \"AI Engineering\" just a marketing term? Possibly, but marketing plays a crucial role in gaining traction for any emerging field. This reminds me of when the \"Data Scientist\" role became mainstream around 2012. Just like data science was built on old techniques like statistics, AI engineering builds on established concepts like vector databases and retrieval methods. These concepts have been around but are now gaining more visibility thanks to recent advancements. 🌍 2️⃣ 𝗧𝗵𝗲 𝗜𝗻𝘁𝗲𝗿𝘀𝗲𝗰𝘁𝗶𝗼𝗻 𝗼𝗳 𝗠𝗟𝗘 𝗮𝗻𝗱 𝗔𝗜𝗘 Machine Learning Engineering is about building models from scratch, while AI Engineering focuses on applying pre-built models to specific use cases. The future will be hybrid systems that combine both. For instance, while traditional ML might classify customer chat intent (e.g., billing vs. general inquiry), AI-driven NLU and conversational agents will be essential for managing dynamic chat flows. 🤖💬 3️⃣ 𝗧𝗵𝗲 𝗜𝗺𝗽𝗼𝗿𝘁𝗮𝗻𝗰𝗲 𝗼𝗳 𝗘𝘃𝗮𝗹𝘂𝗮𝘁𝗶𝗼𝗻 𝗶𝗻 𝗔𝗜 𝗘𝗻𝗴𝗶𝗻𝗲𝗲𝗿𝗶𝗻𝗴 As AI becomes more accessible, evaluation remains the biggest hurdle to widespread adoption. No matter how exciting a use case seems, if you can’t evaluate it effectively, getting stakeholders on board will be a challenge. A successful data science project doesn't end when the model is built; it continues with evaluation. Only through this can you assess the model’s effectiveness and measure the return on investment for improvements. 📊 4️⃣ 𝗣𝗿𝗼𝗺𝗽𝘁 𝗘𝗻𝗴𝗶𝗻𝗲𝗲𝗿𝗶𝗻𝗴 𝗶𝘀 “𝗘𝗮𝘀𝘆” Everyone thinks prompt engineering is easy, but that’s misleading. It’s like talking—everyone can talk, but communicating effectively takes skill. Similarly, prompt engineering requires a systematic approach, experimentation, and documentation to get optimal results. 📝 5️⃣ 𝗔𝗜 𝗔𝗴𝗲𝗻𝘁𝘀: 𝗧𝗵𝗲 𝗡𝗲𝘅𝘁 𝗕𝗶𝗴 𝗧𝗵𝗶𝗻𝗴 An AI agent is anything that can process its environment and take action. Think of an agent that searches the internet: the internet is its environment, and the agent can plan, predict outcomes, and act based on its findings. The challenge is creating the right data for planning because what’s intuitive and easy for humans may not be the same for machines. 🌍💡 --- 💬 𝗪𝗵𝗮𝘁 𝗮𝗿𝗲 𝘆𝗼𝘂𝗿 𝘁𝗵𝗼𝘂𝗴𝗵𝘁𝘀 𝗼𝗻 𝗔𝗜 𝗘𝗻𝗴𝗶𝗻𝗲𝗲𝗿𝗶𝗻𝗴? Follow me for more in-depth breakdowns and insights on AI concepts like these 🫡 #AIEngineering #MachineLearning #DataScience #NaturalLanguageProcessing #AI #TechTrends #ArtificialIntelligence #Innovation",
    "timestamp": "2025-01-23T08:00:02.750Z",
    "matched_at": "2025-03-16T14:03:06.299267"
  },
  {
    "id": "7257925367657578497",
    "author": "asi***lah***an-*********",
    "content": "Research-Trends: Retrieval-Augmented Generation (RAG): Enhancing the Capabilities of Large Language Models Retrieval-Augmented Generation (RAG) is a technique that enhances the capabilities of large language models (LLMs) by allowing them to access and incorporate information from external knowledge bases. This external knowledge can be in the form of documents, articles, or databases. How does RAG work? Query Formulation: A user query is submitted to the RAG system. Document Retrieval: A specialized retrieval system, often powered by techniques like semantic search or vector databases, identifies relevant documents from the knowledge base. Contextual Understanding: The retrieved documents are processed and understood by the LLM. Response Generation: The LLM generates a response that is informed by both its internal knowledge and the external information retrieved from the knowledge base. Benefits of RAG: Improved Accuracy and Factuality: By grounding responses in external knowledge, RAG helps to reduce hallucinations and improve the accuracy of generated text. Enhanced Relevance: RAG can provide more relevant and informative responses by tailoring them to the specific query and the available information. Adaptability to New Information: As new information is added to the knowledge base, RAG systems can adapt and provide up-to-date responses. Domain Expertise: RAG can be used to create domain-specific chatbots or virtual assistants by providing them with access to relevant domain knowledge. #Transformer #AI #ML #NLP #LLM #HybridModels",
    "timestamp": "2024-11-01T01:24:13.351Z",
    "matched_at": "2025-03-16T14:03:06.299268"
  },
  {
    "id": "7217828076125093891",
    "author": "ati***uqm***051*********",
    "content": "I'm excited to introduce an HEC Bot developed over Large Language Models commonly know as LLMs. It's all possible because of prompt engineering for Developers course offered by DeepLearning.AI . I developed this bot using context of HEC Wikipedia to customize the Large Language models. #LLMs #promptengineering #deeplearning",
    "timestamp": "2024-07-13T09:51:54.090Z",
    "matched_at": "2025-03-16T14:03:06.299269"
  },
  {
    "id": "7240609991047417856",
    "author": "sco***olm***",
    "content": "Struggling to keep your code documentation as sharp as your code? Discover how great documentation can boost productivity and bridge the gap between developers and business users. Check out our latest #GFT Engineering blog article on Medium from Aaron Zhao on ‘Evaluating an LLM code documentation generation application’ for valuable insights. Read full article https://okt.to/ZN93aY #teamGFT #Engineering #LLM #AI #Blog",
    "timestamp": "2024-09-14T06:39:05.869Z",
    "matched_at": "2025-03-16T14:03:06.299269"
  },
  {
    "id": "7279549308981403648",
    "author": "oma***waz***",
    "content": "🤖 Ever notice how we expect AI to nail tasks perfectly on the first try? Here's a mind-shifting perspective that changed how I think about AI implementation: The Problem: Most of us use AI like we're asking someone to write an essay without ever hitting backspace. One shot, no iterations, no refinement. Traditional Approach Falls Short: - Single-prompt interactions - Limited context - No self-correction capability - Zero-shot performance limitations The \"Aha\" Moment: Andrew Ng shared a fascinating insight: GPT-3.5 with an agentic workflow (allowing multiple iterations and self-reflection) outperformed GPT-4's single-shot performance on coding tasks. Numbers that matter: • GPT-3.5 (zero-shot): 48% accuracy • GPT-4 (zero-shot): 67% accuracy • GPT-3.5 with agentic workflow: >67% accuracy The New Approach: - Allow AI to plan its work - Enable self-reflection on initial outputs - Implement iterative improvements - Utilize multi-agent collaboration - Incorporate tool usage when needed Real-World Applications: - Software development - Content creation - Research analysis - Problem-solving - Strategic planning Key Learning: Success with AI isn't just about having the most powerful model – it's about creating intelligent workflows that mirror human thought processes. The Future Implications: This approach could democratize AI capabilities, allowing organizations to achieve premium-level results with more accessible models through better process design. #ArtificialIntelligence #Innovation #Technology #FutureOfWork #AI",
    "timestamp": "2024-12-30T17:30:02.722Z",
    "matched_at": "2025-03-16T14:03:06.299270"
  },
  {
    "id": "7281681938082320384",
    "author": "ash***pat***604***",
    "content": "🚀 Sonus-1 Family of Large Language Models (LLMs): Redefining AI Benchmarks in 2025 by Rubik's AI Sonus-1 is setting new standards for AI performance with its Mini, Air, Pro, and Reasoning models. Here’s a quick look at how it’s leading across key benchmarks: 🌟 Benchmark Highlights 📘 MMLU: Broad knowledge reasoning – 87.5% (90.15% with Reasoning) 📊 MMLU-Pro: Advanced reasoning – 71.8% 🧮 Math (MATH-500): Complex problem-solving – 91.8% 🧠 Reasoning (DROP): Paragraph reasoning – 88.9% 💎 GPQA-Diamond: General-purpose question answering – 67.3% 🔥 More Sonus-1 Achievements 💻 Code (HumanEval): Python code generation – 91.0% 📄 Code (LiveCodeBench): Real-world coding accuracy – 51.9% 🔢 Math (GSM-8k): Advanced math reasoning – 97.0% 🛠 Code (Aider-Edit): Structured editing – 72.6% ✅ IF-Eval (Strict): Precision reasoning – 85.2% 🏆 AIME 2024: Competitive math – 53.2% 🔍 Why It Matters Sonus-1 Reasoning integrates a real-time search tool for up-to-date, reliable answers, bridging the gap between intelligence and real-world application. 💻 Want to experience Sonus-1’s power? ➡️ Try it now: chat.sonus.ai/register ➡️ Dive deeper: sonus.ai/blog/sonus-1 How do you see this shaping the future of AI? Let’s discuss in the comments!",
    "timestamp": "2025-01-05T14:44:21.117Z",
    "matched_at": "2025-03-16T14:03:06.299271"
  },
  {
    "id": "7253243378702655489",
    "author": "akh***ako***",
    "content": "🚀 Actionable AI: Enhancing business value with AI-driven decisions Actionable AI is a specialized area within artificial intelligence that emphasizes the practical application of data analysis to produce real-world outcomes. Unlike traditional AI, which primarily focuses on identifying patterns or generating insights from data, actionable AI takes the analysis a step further by translating these insights into concrete actions and tangible results. 1️⃣ Grounding stage with environmental input: This phase involves collecting user interactions such as keyboard and mouse actions, time-aligned screenshots, and optionally, transcripts of audio narrations or network access data. 2️⃣ Analysis stage (“Prompt Engineering”): In the analysis phase, there’s an interplay between the recorded data and user feedback, which informs domain-specific prompt engineering. 3️⃣ Execution stage: In the replay component, the system observes the current state and generates a synthetic action based on models like GPT-4v, Claude, Gemini, or CogVLM. The architecture illustrates various data flows, including control flows (dashed lines) representing the management of the process, deterministic flows (solid lines) indicating predefined operations, and model inferences plus fine-tuning (dotted lines) that suggest adaptive learning and optimization pathways. #LAM #LLM #ActionableAI #AIArchitecture #GroundingStage #AnalysisStage #ExecutionStage #PromptEngineering",
    "timestamp": "2024-10-19T03:19:40.197Z",
    "matched_at": "2025-03-16T14:03:06.299272"
  },
  {
    "id": "7289546348066955266",
    "author": "ham***-me***ani*********4",
    "content": "🚀 Exploring Langchain & Generative AI (GenAI) for Intelligent Q&A Systems 🤖💡 Currently diving deep into the world of Langchain and Generative AI (GenAI) to build intelligent retrieval-augmented generation (RAG) systems that allow for seamless interaction with domain-specific knowledge bases. 🎯 What I’m working on: Langchain for document retrieval, embeddings, and integrating Google Gemini LLM for content generation. Creating real-time Q&A systems using Generative AI models to extract, summarize, and respond based on given URLs. Building custom knowledge systems that enable powerful insights from any web content. This is just the beginning of leveraging Langchain and Generative AI to push the limits of intelligent knowledge management and automation. 🌐 Can’t wait to continue exploring and sharing more! 💥 #Langchain #GenerativeAI #GoogleGemini #LLM #AI #MachineLearning #TechInnovation #AIProjects #NaturalLanguageProcessing",
    "timestamp": "2025-01-27T07:34:42.577Z",
    "matched_at": "2025-03-16T14:03:06.299272"
  },
  {
    "id": "7285039651650686977",
    "author": "bri***sto***erg***",
    "content": "How is your organization ensuring scalable, impactful AI implementations? Scaling AI from pilot projects to enterprise-wide deployments is no small feat, but it’s where the real impact lies. In this insightful episode of the #AIInBusiness Podcast, Steven Eliuk , VP & CTO for AI, Governance, and Data at IBM , dives into the challenges enterprises face when adopting AI at scale. From model validation to compute cost management and infrastructure optimization, Steven provides practical strategies to ensure AI Investments align with long-term strategic objectives. What stood out to me is the emphasis on executive AI fluency and the critical role of tailored approaches and rigorous processes in navigating the complexities of AI adoption. These lessons are invaluable for organizations looking to turn AI into a lasting competitive advantage. Catch the full episode here: https://lnkd.in/d_MacVm #AIinBusiness #AIGovernance #EnterpriseAI #AIAdoption #TechLeadership #DigitalTransformation",
    "timestamp": "2025-01-14T21:06:42.415Z",
    "matched_at": "2025-03-16T14:03:06.299273"
  },
  {
    "id": "7258471297070841856",
    "author": "hoo***a-m***mma*********57a*********",
    "content": "🌟 A Visionary Seminar on the Future of Agentic AI! 🌟 Yesterday, I had the incredible opportunity to attend an insightful seminar with Sir Zia Khan , Sir Ameen Alam , and Sir Muhammad Qasim on the exciting field of Agentic AI. This rapidly evolving area of artificial intelligence is bringing us closer to machines that think, learn, and act with human-like autonomy. 🧠 The Journey of AI: From Narrow to General Intelligence Since its inception in the 1940s, AI has undergone significant advancements, particularly highlighted by the release of Google’s groundbreaking paper, “Attention Is All You Need,” in 2017. This pivotal moment introduced the Transformer model, revolutionizing how machines process and understand human language—an essential step toward achieving true Artificial General Intelligence (AGI). Here’s a brief overview of AI’s developmental stages on the path to AGI: ➡️Artificial Narrow Intelligence (ANI): Specialized AI systems designed for specific tasks, such as language translation and autonomous vehicles. ➡️ Artificial General Intelligence (AGI): The aim to replicate human intelligence across multiple domains, with five key stages: Level 1: Chatbots 🤖 - Basic conversational AIs (e.g., OpenAI’s Model 4.0, Claude’s Sonnet 3.5). Level 2: Reasoners 🤔 - AI capable of intuitive and analytical thought, exemplified by the O1 Model. Level 3: Agentic AI 🌐 - Autonomous agents that make decisions independently, including software and physical agents. Level 4: Innovation and Advanced Reasoning 💡 - Creative problem-solving and self-improvement capabilities. Level 5: Organizational AI 🏢 - AI that adapts and supports human management across industries. 🔑 Key Components of Agentic AI Large Language Models (LLMs) 🧠: Essential for generating human-like responses in natural language processing. Python 🐍: The go-to programming language for AI development, backed by powerful libraries like TensorFlow and PyTorch. Language Graphs 🔗: Enabling complex linguistic understanding by connecting language elements. LangChain 🔄: Techniques for linking AI tasks sequentially to enhance performance. Graph Databases 📊: Managing interconnected data for analyzing complex relationships. Graph Query Languages 📜: Specialized languages like Cypher for data extraction from graph databases. I am truly inspired by the discussions and grateful for the insights shared by our mentors, making complex topics accessible and engaging. The future of Agentic AI holds immense potential, and I’m eager to incorporate these ideas into my projects. #AI #AgenticAI #Innovation #ArtificialIntelligence #FutureOfTech #MachineLearning #AGI If you find this post valuable✨, please repost it to share the knowledge with others. Your support means a lot! 🙌 faculty: Hamzah Syed || Ameen Alam || Hafiz Ali Ahmed || Asharib Ali || Okasha Aijaz || Syeda Hafsa || Aleeza Saleem || Mubashir Ali || Muhammad Bilal || Emad Bin Mohiuddin",
    "timestamp": "2024-11-02T13:33:33.072Z",
    "matched_at": "2025-03-16T14:03:06.299274"
  },
  {
    "id": "7281690497700495360",
    "author": "ahm***ara***",
    "content": "Google : Agents - September 2024 This combination of reasoning, logic, and access to external information that are all connected to a Generative AI model invokes the concept of an agent. Humans are fantastic at messy pattern recognition tasks. However, they often rely on tools - like books, Google Search, or a calculator - to supplement their prior knowledge before arriving at a conclusion. Just like humans, Generative AI models can be trained to use tools to access real-time information or suggest a real-world action. For example, a model can leverage a database retrieval tool to access specific information, like a customer's purchase history, so it can generate tailored shopping recommendations. Alternatively, based on a user's query, a model can make various API calls to send an email response to a colleague or complete a financial transaction on your behalf. To do so, the model must not only have access to a set of external tools, it needs the ability to plan and execute any task in a self-directed fashion. This combination of reasoning, logic, and access to external information that are all connected to a Generative AI model invokes the concept of an agent, or a program that extends beyond the standalone capabilities of a Generative AI model. This whitepaper dives into all these and associated aspects in more detail. #GenerativeAI #AI #ArtificialIntelligence #AIAgents #AIML #MachineLearning #DeepLearning #LargeLanguageModels #LLMs #AI #AIAgent #Agents #AItools #ToolUse #APIintegration #Automation #AutonomousAgents #Reasoning #Logic #PatternRecognition #KnowledgeRetrieval #InformationAccess #RealTimeInformation #TaskPlanning #TaskExecution #SelfDirectedAI #PersonalizedRecommendations #CustomerService #FinTech #Whitepaper #AISearch #GoogleAI #AIforBusiness #AIinnovation #FutureofAI",
    "timestamp": "2025-01-05T15:18:21.888Z",
    "matched_at": "2025-03-16T14:03:06.299275"
  },
  {
    "id": "7222220385344184320",
    "author": "nan***mul***ara***",
    "content": "𝗜𝘀 𝘁𝗵𝗶𝘀 𝘁𝗵𝗲 𝗯𝗲𝗴𝗶𝗻𝗶𝗻𝗴 𝗼𝗳 𝘁𝗵𝗲 𝗲𝗻𝗱 𝗼𝗳 𝗢𝗽𝗲𝗻 𝗔𝗜? Open-source LLMs just hit a new milestone! Llama-3 405B outperforms Closed-source GPT-4 on most metrics. (Check screenshot in comments) OpenAI now has to outperform this to remain relevant. Check out the Llama-3 paper: https://lnkd.in/gUdh_zDR What do you think? ---- 🎯 Follow for the best of AI: https://lnkd.in/gFwv7QiX #AI #innovation #technology #automation",
    "timestamp": "2024-07-25T12:45:22.203Z",
    "matched_at": "2025-03-16T14:03:06.299276"
  },
  {
    "id": "7275013229662105600",
    "author": "aks***-vy***848*********",
    "content": "🚀 Build RAG Applications Effortlessly with Langflow! If you've ever wanted to create sophisticated Retrieval-Augmented Generation (RAG) applications but felt daunted by the complexities of coding , Say hello to LangFlow—a game-changing tool that simplifies building RAG applications with a drag-and-drop interface! Langflow is a low-code/no-code interface designed to streamline your workflow for building LLM-powered apps. With its intuitive canvas, you can visually connect components, tweak parameters, and create robust applications without diving deep into complex code. Use Cases: 💡 Custom Chatbots: Build bots that can fetch answers from your knowledge base while understanding your users context. 💡 Document Summarization: Quickly create a tool that summarizes massive text data for quick insights. 💡 Knowledge Assistants: Design assistants that retrieve accurate, real-time data for decision-making. Example Flow: Imagine building a chatbot that retrieves insights from a company handbook: 1️⃣ Drag a text splitter to segment your document into chunks. 2️⃣ Connect it to a vector store retriever (like FAISS or Pinecone) for embedding and search. 3️⃣ Add an LLM (e.g., OpenAI, Cohere) to generate natural language responses. 4️⃣ Fine-tune prompts and test directly in the LangFlow interface! In minutes, you’ll have a functional chatbot ready to deploy – no heavy lifting required! Link: https://www.langflow.org/ #LangFlow #RAG #AI #LangChain #Innovation #OpenSource #DragAndDrop#AI #NoCode #LangChain #MachineLearning #DataScience",
    "timestamp": "2024-12-18T05:05:17.133Z",
    "matched_at": "2025-03-16T14:03:06.299276"
  },
  {
    "id": "7171915145114251264",
    "author": "fei***i-l***541******",
    "content": "After attending the State of the Union speech last night as a guest of my Congresswoman Anna Eshoo, I had a brief exchange with President Biden. I told him that his speech marked a historical moment - he was the first president to ever mention artificial intelligence during the #SOTU . He replied, “Yes! And keep it safe.” What a tremendous moment in time, and I’m so thankful to Anna not only for including me but also for her leadership on AI in Congress. Anna, with Rep. Michael McCaul, Rep. Don Beyer , and Rep. Jay Obernolte , introduced the critical CREATE AI Act, a bipartisan bill that will create stronger American public-sector AI.",
    "timestamp": "2024-03-08T17:10:18.311Z",
    "matched_at": "2025-03-16T14:03:06.299277"
  },
  {
    "id": "7214310864558911488",
    "author": "rav***ra-***pur*********93",
    "content": "While compute, data storage and infra costs will eventually fall making costs less critical. as of now if you need to handle lengthy prompts and accuracy is key then GPT4 is the better option. Consider the value you will deliver to the customer with complex lengthy prompts with high accuracy - the credibility and hence user adoption will benefit. #AI #LLM #Prompts",
    "timestamp": "2024-07-03T16:55:45.496Z",
    "matched_at": "2025-03-16T14:03:06.299278"
  },
  {
    "id": "7211672237534289921",
    "author": "ale***der***ish******",
    "content": "Sharing a great, thought-provoking post by Boris Levant on the shortcomings of the Turing Test as a metric for AI progress (the link is at the bottom of the post). In the comments, Boris makes this great distinction between the three sorts of behaviors we are trying to get models to emulate: 1. Acting Human 2. Thinking Human 3. Thinking/ Acting Rationally (with humans how we think and how we act are often very different, but for purely rational agents the only distinction is the realm of activity) Training models to do any one of these should be separate and mostly disjoint tasks. Yet, in the current state of AI, we expect or try to train a single model to do all of these. In reality, the one we should be prioritizing should be the third one, the goal of creating rational agents. The goal of technological development should be to overcome human weaknesses, and as has been repeatedly shown, as a species we struggle with rationality. If this is indeed the goal, the #RLHF is a terrible fine-tuning strategy. https://lnkd.in/dRtFpDaJ #ai #reinforcementlearning",
    "timestamp": "2024-06-26T10:10:47.784Z",
    "matched_at": "2025-03-16T14:03:06.299279"
  },
  {
    "id": "7247963218503950336",
    "author": "rid***z67***",
    "content": "My Latest Article on Medium! 🌐 I’ve recently explored the powerful components of LangChain, a versatile framework for building applications with language models. This article covers various key aspects, including: ‣‣ Chat Models ‣‣ LLM ‣‣ Messages ‣‣ Prompt Templates ‣‣ Example Selectors ‣‣ Output Parser ‣‣ Chat History ‣‣ Documents ‣‣ Document Loaders ‣‣ Text Splitters ‣‣ Embedding Models ‣‣ Vector Stores ‣‣ Retrievers 👉 Whether you're a developer, researcher, or AI enthusiast, I hope this article provides valuable insights into maximizing the potential of language models in your applications. I’d love to hear your thoughts and any feedback you might have! Xeven Solutions , PIAIC , Governor Sindh Initiative for GenAI, Web3, and Metaverse , Ameen Alam , Muhammad Qasim , Zia Khan , Asharib Ali #LangChain #AI #Machine #Learning #NaturalLanguageProcessing #AIApplications",
    "timestamp": "2024-10-04T13:38:11.907Z",
    "matched_at": "2025-03-16T14:03:06.299279"
  },
  {
    "id": "7285023336936435712",
    "author": "and***yng***",
    "content": "Just released: New AI Climate Simulator that you can play with. Visualize how geoengineering can slow global warming. There is no longer any path to limiting warming to 1.5 degrees Celsius (Paris Agreement), unless we use geoengineering. Reflecting 1% of sunlight away from earth would lead to an extra ~1 degree of cooling. Our simulator lets you explore how geoengineering via Stratospheric Aerosol Injection (SAI) gives us new paths to keep warming to 1.5 degrees. I think SAI is a promising technology worth serious exploration. Check out the simulator here: planetparasol.ai Big thanks to collaborators Jeremy Irvin , Jake Dexheimer , Dakota Gruener , Charlotte DeWald, PhD , Daniele Visioni , Duncan Watson-Parris , Douglas MacMartin , Joshua Elliott , Jürg Luterbacher, Prof. PhD , Kion Yaghoobzadeh",
    "timestamp": "2025-01-14T20:01:52.689Z",
    "matched_at": "2025-03-16T14:03:06.299280"
  },
  {
    "id": "7290854176085975041",
    "author": "kir***orn***",
    "content": "Announcement from Helen Yu ... virtual event on Feb.13 to discuss the Role of Data in Enterprise AI Applications...",
    "timestamp": "2025-01-30T22:11:33.065Z",
    "matched_at": "2025-03-16T14:03:06.299281"
  },
  {
    "id": "7191421168451555328",
    "author": "ola***an-***buy*********enc***",
    "content": "𝐓𝐫𝐚𝐝𝐢𝐭𝐢𝐨𝐧𝐚𝐥 𝐌𝐋 𝐌𝐨𝐝𝐞𝐥𝐬: 𝐓𝐡𝐞 𝐅𝐨𝐮𝐧𝐝𝐚𝐭𝐢𝐨𝐧𝐬 𝐨𝐟 𝐀𝐈 𝐄𝐱𝐜𝐞𝐥𝐥𝐞𝐧𝐜𝐞 🤖 🧠 The data science community is abuzz with excitement, hurtling through an AI hype cycle fueled by revolutionary concepts like Generative AI, Transformer Models, and LLMs! These trailblazing models are spearheading a new era of innovation, pushing the boundaries of what's possible, and showcasing the unparalleled capabilities of modern machine learning. Despite the rapid pace of innovation, it's crucial to remember the fundamental principles that established the field of machine learning. Traditional machine learning models, such as linear regression, decision trees, random forests, k-means, and support vector machines, have stood the test of time and continue to underpin many real-world applications. It is also critical to have a good grasp of these traditional ML models because: 📚 Foundational Knowledge: Traditional machine learning models provide the basis for understanding more complex AI concepts. They introduce essential ideas like supervised and unsupervised learning, overfitting, regularization, and optimization techniques. 🧱Building blocks for innovation: Traditional models are often combined or modified to create new, more powerful AI architectures. Familiarity with the basics enables you to contribute to innovation and tailor solutions for specific problems. 💡 Interpretability and intuition: Fundamental models provide transparency and intuition about how AI works. This understanding is vital for identifying biases, errors, and areas for improvement in more complex models. ⬛❓ Avoiding black box syndrome: Without a solid grasp of fundamentals, you might treat advanced AI models as black boxes, lacking insight into their inner workings. This can lead to misunderstandings and misapplications. 🚀 Context for advancements: Knowing the limitations and challenges of traditional models helps appreciate the innovations and breakthroughs in Generative AI and LLMs. You'll better comprehend the problems they solve and their trade-offs. 🔧 Efficient troubleshooting: Understanding traditional models allows you to learn more complex AI concepts and troubleshoot and debug issues more effectively. ⚖️ Appreciation for ethical considerations: Foundational knowledge allows you to better address ethical concerns in AI development and deployment, such as bias and explainability. During the month of May, I'll be sharing insights on the most popular traditional machine learning models, exploring their inner workings, practical use cases, applications to GenAI, limitations, assumptions, and the timeless wisdom they offer to aspiring data scientists and seasoned professionals alike. Join me on this journey as we uncover the beauty and elegance of machine learning, one model at a time. #MachineLearningMay #ML #TraditionalModels #DataScience #AI #DeepLearning #GenAI #LLMs",
    "timestamp": "2024-05-01T13:00:16.677Z",
    "matched_at": "2025-03-16T14:03:06.299282"
  },
  {
    "id": "7282841242000879616",
    "author": "and***yng***",
    "content": "New short course: Build Long-Context AI Apps with Jamba. Learn about state space models (SSMs), which have emerged as an alternative to transformers. Specifically, Jamba is a hybrid transformer-Mamba architecture that combines strengths of the transformer with ideas from SSMs. This course is built with AI21 Labs and taught by Chen Wang and Chen Almagor . The transformer architecture is computationally expensive when handling very long input contexts. But there's an alternative called Mamba, a selective state space model that can process very long contexts with a much lower computational cost. However, researchers found that the pure Mamba architecture underperforms in understanding the context, and gives lower-quality responses. To overcome this, AI21 developed the Jamba model, which combines Mamba's computational efficiency with the transformer's attention mechanism to help with the output quality. In this course, you’ll learn about how state space models, and Jamba, work. You’ll also learn how to prompt Jamba, use it to process long documents, and build long-context RAG apps. - Learn how Jamba combines transformer and state space model architectures to achieve high performance and quality - Use the AI21 SDK, with an example of prompting over a large 200k-token annual financial report of Nvidia - Use Jamba for tool-calling, with hands-on examples from calling simple arithmetic calculations to a function that returns quarterly company financial reports. - Learn how training for long context is done, and the metrics used for its evaluation - Create a RAG app using the AI21 Conversational RAG tool and build your own RAG pipeline that uses Jamba and LangChain. By the end of this course, you'll learn how to build applications that can handle context as long as an entire book. Please sign up here: https://lnkd.in/gvvjJ5tg",
    "timestamp": "2025-01-08T19:31:00.721Z",
    "matched_at": "2025-03-16T14:03:06.299283"
  },
  {
    "id": "7271617937289965568",
    "author": "tim***mer***",
    "content": "Supabase #launchweek13 day 5: Super-charged database.build ! If you didn't see, Supabase open sourced an in-browser Postgres AI agent, letting you build backends in your browser. Pretty nuts. In this 2.0 release, we've shipped: - Bring-your-own-LLM - OpenAI compatibility - CORS-friendly APIs - Service workers - Live Share - Deployments - Mobile Support Check out Greg Richardson 's amazing demo here, testing out 3 different LLM's: https://lnkd.in/gYcxixwx",
    "timestamp": "2024-12-08T20:13:36.344Z",
    "matched_at": "2025-03-16T14:03:06.299283"
  },
  {
    "id": "7201009707942092801",
    "author": "rai***zi",
    "content": "In Gen-AI development one of the most popular term is \"prompt\" or \"prompt engineering\". Why this term is not just another buzz word and why it is so important in Gen-AI? I wanted to test vision capability of two most powerful multi-modal large language models through apis/code, GPT 4o from Open-AI and Gemini-1.5-Pro from Google. Idea was to see if these models find out what's wrong in this image? With some prompts I got incorrect answers -> \"It's a salad\", \"It's a chicken salad\" etc. etc. With right prompt I got correct answer something like this ->\"There is a large insect in the salad. It appears to be a katydid or grasshopper, which is not something you'd want to find in your food.\" #genai #llms #promptengineering",
    "timestamp": "2024-05-28T00:01:42.632Z",
    "matched_at": "2025-03-16T14:03:06.299284"
  },
  {
    "id": "7198292670841008129",
    "author": "fed***cob***ear***",
    "content": "🚀 The world of Data Analytics might evolve at an unprecedented pace with LLMs Last week's launch of GPT 4o and the unveiling of Microsoft Copilot have given us a glimpse into the future of how we interact with technology and, more importantly, enterprise data. While solutions like Tableau , Power BI Visualization , ThoughtSpot , Snowflake + Streamlit , and those created in-house may provide the technical answers. However, they all relay on the success of any data-driven initiative hinges on the quality of data, robust data models, efficient data pipelines, a well-defined semantic layer and, most importantly, the key business questions understanding. As we continue to explore and understand these technologies, I looking forward to Microsoft's new Fabric presentation tomorrow: https://lnkd.in/dhbikVUi #DataScience #AI #MachineLearning #Microsoft #GPT4 #EnterpriseData",
    "timestamp": "2024-05-20T12:05:10.516Z",
    "matched_at": "2025-03-16T14:03:06.299285"
  },
  {
    "id": "7198348869405966336",
    "author": "fra***ino***y",
    "content": "BERT: A Powerful Tool for Natural Language Processing One of the challenges of traditional Natural Language Processing (NLP) methods is their inability to understand contexts in texts. This owes largely to the fact that these methods analyze texts sequentially, missing key connection between words and their surrounding elements. This is where BERT comes in. BERT, or Bidirectional Encoder Representations from Transformers, is a type of Large Language Model (LLM) that has changed how we approach the field of NLP. Unlike previous models of its kind, BERT is trained on unlabeled text data in a bidirectional manner, allowing it to understand the context of words within a sentence. This capability makes BERT highly effective in various NLP applications like text encoding, question answering and response generation. Text Encoding BERT can transform text into a numerical representation that captures its meaning. This allows other machines to easily process and analyze the text. Search engines can leverage this for tasks like summarizing documents or ranking search results based on relevance. Question Answering BERT is excellent at finding answers to your questions within a given text corpus. Imagine posing a question about a specific topic on a webpage – BERT can analyze the text and pinpoint the relevant answer section. Response Generation BERT can craft human-quality responses to prompts and emails. This can be incredibly useful for chatbots or virtual assistants, enabling them to have more natural and engaging conversations. Search Engine Example Let's take a search engine using BERT. When you enter a query, BERT can analyze the surrounding words and context to understand your intent. It can then look for webpages that not only contain the keywords but also discuss them in a relevant way. This leads to more accurate and user-friendly search results. Image Source: #NLP #ArtificialIntelligence #MachineLearning #BERT #LLM #TechnologyInnovation",
    "timestamp": "2024-05-20T15:48:29.287Z",
    "matched_at": "2025-03-16T14:03:06.299286"
  },
  {
    "id": "7287832005512192000",
    "author": "******",
    "content": "In case you've missed it, DeepSeek AI 's new reasoning model R1 is exciting (right video - R1 vs. left - OpenAI GPT O1). Quick summary: 📈 R1 match or surpasses OpenAI's O1 on multiple benchmarks 💻 R1 is open-source and can be run locally on a macbook 💲R1 is MUCH cheaper than OpenAI's O1: - Input tokens: $0.55 vs. $15 / M tokens - Ouptut tokens: $2.19 vs. $60 / M tokens ⚪ R1 was developed by a Chinese company on both English and Chinese information 🔼 In the video you see what each model generated when asked to implement a rotating triangle with red ball in it. Prompt: \"write a python script for a bouncing red ball within a triangle, make sure to handle collision detection properly. make the triangle slowly rotate. implement it in python. make sure ball stays within the triangle\" Try deepseek: http://chat.deepseek.com/ Download the model: https://lnkd.in/dnBpHNi7 Tutorial for running R1 locally: https://lnkd.in/dmTUaMF5 #ai #llms",
    "timestamp": "2025-01-22T14:02:31.465Z",
    "matched_at": "2025-03-16T14:03:06.299286"
  },
  {
    "id": "7193977767737106432",
    "author": "******",
    "content": "It sometimes feels like #enablement is like the butterfly effect, when you randomly flap your wings and then a hurricane of results happens somewhere else. It is easy to feel this way, but instead I push myself to think more strategically by doing a few things: 1. 🎯 Define Clear Outcomes: - Insight from Forrester: \"Companies with well-defined sales goals are 33% more likely to achieve top-quartile financial performance.\" - Work closely with GTM leadership to establish and align on precise business outcomes. One example is using the Sales Velocity focus with Kunal Pandya and Sales Velocity Labs 2. 📊 Embrace Predictive Analytics: - Gartner Reports: \"Organizations using predictive analytics see up to 20% higher ROI on sales activities.\" - Use data proactively to forecast outcomes and refine tactics continuously. Someone to help is Sally Ladrach with data for enablement. 3. 🧪 Rigorous Testing: - Data from HubSpot: \"Businesses that regularly test their sales strategies can improve conversion rates by up to 50%.\" - Implement a structured testing framework to validate the effectiveness of each strategy. 4. 🔁 Systematic Feedback: - Insights from Salesforce: \"80% of high-performing sales teams rate their feedback loops as excellent or above average.\" - Develop a robust feedback system that is agile and responsive to team and market needs. This can be done in various ways, but Greg Qualls talks about feedback specifically for revenue enablement. 5. 🔄 Integration Across Functions: - Forrester Finding: \"Integrated customer journeys improve client retention by 25%, driving cross-functional sales enablement.\" - Ensure enablement tools and strategies align across all departments to unify the customer experience. Another reason why Revenue Enablement and not just Sales enablement is so important. 6. ⏳ Monitor and Scale: - Research from Gartner: \"Sustained success in sales enablement is 30% more likely when organizations focus on scalability and long-term metrics.\" - Continuously track long-term trends to adapt strategies that support scalable growth. What do you think?",
    "timestamp": "2024-05-08T14:19:17.447Z",
    "matched_at": "2025-03-16T14:03:06.299287"
  },
  {
    "id": "7138640269654061057",
    "author": "chr***ina***nec***",
    "content": "Incredibly proud of the Gainwell Technologies #marketing team today, led by our fearless Senior Director, Creative & Brand Reginald Foxworth , for bringing to life the Gainwell brand evolution through our career excellence webinar series. Helping our colleagues see the updates, understand the WHY behind our evolving brand, and sharing the goodness of what's still to come - well, that's pretty dang cool. Thank you Daniel Birnbaum , Adrian Garza , Maria Gordon , & Tricia Elliott for sharing your insights with the group!!",
    "timestamp": "2023-12-07T21:27:49.786Z",
    "matched_at": "2025-03-16T14:03:06.299288"
  },
  {
    "id": "7226809912385843200",
    "author": "******",
    "content": "Imagine converting a website design from Figma to live code and making it responsive using AI —all in under 5 minutes! 😲 Here’s the magic formula: Access the Figma to Wix Studio plugin: Start by setting up the export from your Figma designs to Wix Studio. Import from Figma: Seamlessly connect your Figma file to Wix Studio. Paste the link and hit connect: Integrate your design with a simple click. Export frame by frame: Choose your starting point and export your designs efficiently. Use Inbuilt AI: Automatically make your website responsive on all devices with Wix Studio’s powerful AI tools. 💡 Why this is a game-changer: Efficiency: Save hours of manual coding. Accuracy: Ensure your design vision is perfectly translated into a live website. Although the AI is still not robust, but does gets the job done to an extent were rest of the job becomes a breeze. Customize and review as needed! I tested this process and was blown away by the speed. If you’re a web designer or developer looking to streamline your workflow, you need to try this out! Curious to see how it works for you? Check this video. P.S. Repost this for your network. Thank you! #webdesign #sponsored #wixstudio #figma",
    "timestamp": "2024-08-07T04:42:30.721Z",
    "matched_at": "2025-03-16T14:03:06.299289"
  },
  {
    "id": "7186374527025614848",
    "author": "mat***ssa***r",
    "content": "🔍 Exploring New Possibilities for using AI in Docs-As-Code Processes! 🔍 At Improvementsoft, we're diving into innovative ways to streamline Docs-as-Code processes. I'm currently researching the use of Large Language Models (LLM) to automatically review documents in GitHub pull requests, aiming to boost efficiency and precision. Curious about enhancing your own documentation workflows with AI? Feel free to reach out if you’d like to discuss how we can help improve your processes! #techcomm #docsAsCode #LLM #ai #github",
    "timestamp": "2024-04-17T14:46:43.590Z",
    "matched_at": "2025-03-16T14:03:06.299289"
  },
  {
    "id": "7223764223649083395",
    "author": "shu***ian***-ab*********",
    "content": "I recently attended a fantastic workshop on Large Language Models (LLMs) and Python GUI Chatbots, organized by NP Overflow and AiSIG. 🎓 The session was incredibly eye-opening and beginner-friendly, offering a comprehensive look at LLMs and their practical applications. 💡 We delved into the structure and functionality of LLMs, and explored how to create interactive Python GUI chatbots. The hands-on activities and clear explanations made complex concepts accessible and engaging. I’m excited to continue exploring what Overflow has to offer and dive deeper into the world of AI ! 🤖✨ #LLMs #AI #Workshop #LearningJourney #BeginnerFriendly #ArtificialIntelligence",
    "timestamp": "2024-07-29T19:00:01.952Z",
    "matched_at": "2025-03-16T14:03:06.299290"
  },
  {
    "id": "7246585128309714944",
    "author": "ima***bdu***h-4*********",
    "content": "The rise of AI -LLMs We are currently witnessing an intense competition in large language model (LLM) development, with prominent AI entities and new entrants continuously contributing to this evolving landscape. As of now, over 125 commercial LLMs are part of the ecosystem, reflecting a significant 120% increase in releases between 2022 and 2023. This does not even consider the extensive number of open-source models available on platforms such as HuggingFace. These models are demonstrating considerable advancements in performance, specialization, and multimodal capabilities. For the original interactive image from information is beautiful: https://lnkd.in/d4w5pqkR #AI #LLM #GenAI #ML #datascience Ronald van Loon Aruna Pattam Kirk Borne, Ph.D. Mike Quindazzi",
    "timestamp": "2024-09-30T18:22:09.594Z",
    "matched_at": "2025-03-16T14:03:06.299291"
  },
  {
    "id": "7281279301168119808",
    "author": "aur***s-g***iun***",
    "content": "Found this amazing website that explains the 𝗰𝗼𝗺𝗽𝘂𝘁𝗮𝘁𝗶𝗼𝗻 𝘁𝗵𝗮𝘁 𝗵𝗮𝗽𝗽𝗲𝗻𝘀 𝘄𝗵𝗶𝗹𝗲 𝗽𝗿𝗲𝗱𝗶𝗰𝘁𝗶𝗻𝗴 𝘁𝗵𝗲 𝗻𝗲𝘅𝘁 𝘁𝗼𝗸𝗲𝗻 𝘃𝗶𝗮 𝗧𝗿𝗮𝗻𝘀𝗳𝗼𝗿𝗺𝗲𝗿 𝗔𝗿𝗰𝗵𝗶𝘁𝗲𝗰𝘁𝘂𝗿𝗲 𝗯𝗮𝘀𝗲𝗱 𝗟𝗟𝗠𝘀. If you have few spare minutes be sure to check it out: ➡️ It runs by downloading GPT-2 to your browser. ➡️ You can ask it to generate the next token for your example text. ➡️ All the computations are displayed in real time as the generation is happening. ➡️ You can zoom in and explore details of each step. You can find the website here: https://lnkd.in/dfdeC8_U I find the creativity behind the tool fascinating! Let me know your thoughts 👇 #LLM #MachineLearning #AI ------- Be sure to ♻️ repost if you found the content useful. Follow me and hit that bell if you want to get a daily dose of useful AI related content in your feed!",
    "timestamp": "2025-01-04T12:04:25.003Z",
    "matched_at": "2025-03-16T14:03:06.299292"
  },
  {
    "id": "7252230674030411777",
    "author": "mar***-ra***ed-*********b52******",
    "content": "Today begun #youngAfricaInnovates project boot camp in Bolgatanga, for the upper east region. #caighana is fortunate to be selected along side six weavers from three of our communities groups. This boot camp is aimed at fine tuning the identified innovations prior to implementation. Significant milestone is the quality of innovators that have been scouted for the YAI project-UER bringing everyone on board without exclusion. #undpghana#mfbbaskets#mastercardfoundation",
    "timestamp": "2024-10-16T08:15:32.592Z",
    "matched_at": "2025-03-16T14:03:06.299293"
  },
  {
    "id": "7251981405843251200",
    "author": "******",
    "content": "Our CEO May Habib was on CNBC Closing Bell explaining how Writer is building our own LLM at a fraction of the cost of other models. Watch the 4-min interview to hear May explain what we mean by synthetic data, why we're so invested in this approach, and what it means for our enterprise customers! My favorite points: Companies aren't \"GPU rich\"! We've trained a separate LLM that takes real data and converts it into structured, clean, and clear synthetic data that's ideal for training AI. This results in high-performance models that companies can run in their own environments and at a lower cost. Link to video: https://lnkd.in/g7K3BUgR",
    "timestamp": "2024-10-15T15:45:02.423Z",
    "matched_at": "2025-03-16T14:03:06.299293"
  },
  {
    "id": "7197083411163799552",
    "author": "aya***ebn***",
    "content": "🚀GPT Neo 2.7 B model with HuggingFace 🤗 in 3 lines of coding 🧑💻If you don’t have much time 🕰️ to invest on learning how to implement Large Language Model (LLM) in Hugging Face 🤗, then I gotcha cover you. You will learn the followings in just 5 mins: ✅Building LLM in hugging face ✅Ask anything and get LLM response in seconds ✅GPT Neo implementation using python 🐍 in 3 lines of coding 🔗 5 mins video link: https://lnkd.in/gG6uwA6s 🔥SUBSCRIBE to my channel “AD ACADEMY- AI for Aam Janta” for more such contents on generative AI 🤖, LLM, etc https://lnkd.in/gzafJ-HB #gpt #llm #generativeai #huggingface #python #ai #youtube",
    "timestamp": "2024-05-17T04:00:00.538Z",
    "matched_at": "2025-03-16T14:03:06.299294"
  },
  {
    "id": "7288677034854088704",
    "author": "ter***emi***",
    "content": "AI Will Make Insurance Human Again #AI #AIio #BigData #ML #NLU #Futureofwork http://ow.ly/9iak30sJanV",
    "timestamp": "2025-01-24T22:00:22.145Z",
    "matched_at": "2025-03-16T14:03:06.299295"
  },
  {
    "id": "7287579926050848772",
    "author": "hpi***s",
    "content": "Building enterprise-grade AI agents is hard. We just made it a whole lot easier. 🚀 Excited to finally share what we’ve been working on over the past few months! AI agents are the next big thing—you already know that. 😄 But building enterprise-grade AI agents is no walk in the park. It involves tackling multiple challenges: - Managing agent memory with RBAC/ security - Orchestrating agent behavior - Making the agent accessible via a UI, API, or other channels - Implementing human-in-the-loop to verify outputs - Monitoring agent performance That’s a lot of work! So, we built DeepModel, an end-to-end, fully managed agent builder platform. It comes packed with everything you need—RAG, agent orchestration, UX, tooling, human-in-the-loop, and monitoring—all in one ready-to-go platform. And here’s the kicker: Building an AI agent typically means starting in a Jupyter Notebook and writing Python code. But with DeepModel, you can build your agent by simply providing instructions in plain English! Want to extend it further with your own code? We are going to support that, too. Our goal is simple: help you ship AI agents faster than it takes to set up dependencies in your Jupyter Notebook. 🎞️ Below is a 101-second fly-over video of the builder platform. ✅ Check out our website ( www.deepmodel.ai ) for more videos and sign up to get access (there’s a waitlist, but the sooner you join, the sooner you’ll be building). 🤗 Wait, there’s more! We’re also rolling out a suite of vertical AI agents built on DeepModel, like Apex for healthcare Prior Authorization and Nova for Developer Relations. Follow me here to get the updates. #ai #aiagents",
    "timestamp": "2025-01-21T21:20:51.041Z",
    "matched_at": "2025-03-16T14:03:06.299296"
  },
  {
    "id": "7262464022359281664",
    "author": "ari***ika***",
    "content": "WikiBot🤖: Your Wikipedia Companion! I'm thrilled to share my latest project, WikiBot🤖! Which uses Retrieval-Augmented Generation (RAG) to provide accurate, real-time answers to user queries by leveraging both large language models and live Wikipedia data. It’s a step towards making Wikipedia’s vast knowledge base more interactive and accessible! 🌟Key Highlights: - Real-Time Knowledge Retrieval: Instantly fetches and answers queries by pulling data from Wikipedia. - Tech Stack: - Streamlit: Interactive UI for real-time user interaction. - Requests & Beautiful Soup: Fetches and extracts core content from Wikipedia pages. - RecursiveTextSplitter: Breaks down Wikipedia text into manageable, searchable chunks. - Hugging Face’s sentence-transformers/all-MiniLM-L6-v2: Generates text embeddings for precise semantic search. - Chroma Vector Database: Stores and retrieves embeddings efficiently. - LangChain: Connects the language model with the vector database for seamless query handling. - Meta-Llama-3-8B-Instruct Model (Hugging Face API): Powers advanced natural language processing. - Directive-Based Prompting: Guides response generation to ensure relevance and contextual accuracy. Why I Built WikiBot?! With Wikipedia as a vast, ever-evolving knowledge source, I wanted to create a tool that allows users to interactively explore its content through natural language queries. WikiBot combines cutting-edge AI with Wikipedia’s robust information, making it an invaluable companion for quick, reliable answers! Checkout WikiBot!👉 https://lnkd.in/eksdgcdr #MachineLearning #NLP #LLM #LangChain #Wikipedia #AI #HuggingFace #Chroma #RAG #DataScience #Innovation #OpenSource #Chatbot",
    "timestamp": "2024-11-13T13:59:12.965Z",
    "matched_at": "2025-03-16T14:03:06.299296"
  },
  {
    "id": "7284070460760211457",
    "author": "tsa***not***",
    "content": "LTM-1 casually exploding my brain 🤯 Perfect example of why we desperately need Artificial Long-Term Memory: When your control-z doesn't go back that far... don't sweat it... just ask Pieces for Developers Saved myself so much headache 😌",
    "timestamp": "2025-01-12T04:55:29.302Z",
    "matched_at": "2025-03-16T14:03:06.299297"
  },
  {
    "id": "7265282224588029953",
    "author": "raz***l-m***afa*********4",
    "content": "I'm excited to share that I have successfully completed two transformative courses: 1️⃣ \"LangChain for LLM Application Development\" 2️⃣ \"Functions, Tools, and Agents with LangChain!\" These courses, offered by DeepLearning.AI , have been game-changers in expanding my expertise in large language models (LLMs) and their real-world applications. 💡 Key takeaways include: ✅ Advanced LangChain skills for building dynamic, intelligent systems. ✅ Mastery of tools, functions, and agents to empower LLMs for diverse tasks. ✅ Practical knowledge in prompt engineering, RAG, and more. This journey reaffirms my passion for leveraging AI to solve complex challenges. I look forward to collaborating with like-minded professionals to push the boundaries of AI innovation! Let's connect and innovate together. 🚀 #AI #LangChain #DeepLearning #LLM #MachineLearning #TechInnovation Harrison Chase",
    "timestamp": "2024-11-21T08:37:44.723Z",
    "matched_at": "2025-03-16T14:03:06.299298"
  },
  {
    "id": "7283008882694615040",
    "author": "nis***hpa***k",
    "content": "Microsoft 14 billion-parameter latest SLM Model Phi-4 can now be downloaded, fine-tuned, and deployed for free. Model link - https://lnkd.in/gXUJqj3R Technical Paper - https://lnkd.in/g2apsxuk The paper claims that it outperforms Llama 3.3 70B (nearly five times bigger) and OpenAI’s GPT-4o Mini on several benchmarks. Phi-4 Leveraging high-quality synthetic data, generated through innovative multi-agent workflows. Phi-4 isn’t just another model; it’s a step forward in making powerful AI tools widely accessible while ensuring they’re aligned, efficient, and ready for real-world challenge #AI #Phi4 #MachineLearning #OpenSource #STEM #LLM #Innovation Microsoft Hugging Face",
    "timestamp": "2025-01-09T06:37:09.362Z",
    "matched_at": "2025-03-16T14:03:06.299299"
  },
  {
    "id": "7221795491460608000",
    "author": "zah***ddi***ava******",
    "content": "𝗛𝗼𝘄 𝘁𝗼 𝗧𝗵𝗶𝗻𝗸 𝗔𝗯𝗼𝘂𝘁 𝗔𝗜 𝗔𝗴𝗲𝗻𝘁𝘀 As I continue to experiment with and implement 'agents' at work, I realize that thinking about agents beyond automation enablers can lead to a better approach to creating AI agents. One of the best approaches was suggested by Andrej Karpathy - the \"LLM OS.\" Andrej suggests that LLMs can coordinate and manage resources similarly to an operating system, allowing for more sophisticated interactions without user intervention. This positions LLMs not just as tools, but as integral components of a broader computational framework. The LLMs can exhibit \"agentic\" behavior, enabling them to take initiative and make decisions based on user input. While we are still far from fully autonomous agents, in my opinon you can still create a scaled-down version for specific tasks by following these steps: - Define Clear Objectives - Break Down Tasks - Select Appropriate Tools - Implement Decision-Making Logic through prompts - Enable Adaptability for ambiguous inputs - Incorporate Feedback Mechanisms - Test and Iterate Let me know what you think. LLM OS video in comments. #AI #LLM #AIAgents",
    "timestamp": "2024-07-24T08:36:59.613Z",
    "matched_at": "2025-03-16T14:03:06.299300"
  },
  {
    "id": "7238388087054123011",
    "author": "the***hog***h",
    "content": "Worlds TOP open source model is a \"prompt\" engineered solution? 🤔 Recently released by Matt Shumer , llama 3 70B trained on refelection dataset beats all time top tier models like gpt-4o, claude-3.5-sonnet etc. 🚀 But how is it possible?? ➡️ By adding few prompts and ➡️ <reflection> token in vocab dictionary of model. Matt used these tags to make LLM behave like \"agents\", self reflecting on its mistakes and give correct response. Though LLMs are next token prediction decoder-only transformers but attention is what makes these unique features get learned by model during pretraining. 🧠 But isn't it possible to prompt LLM about the exact way to think and get response in such format? Yup may be, you can test out yourself with the prompt I have shared a link of in my comments. Now Reflected LLAMA 70B can, ➡️ count how many words are there in a sentence or letters in a word ➡️ can't mistake what which one is larger 9.9 or 9.11 🤡 But downside is the number of tokens it outputs even at most naive questions. credits: prompt by rwl4 on The Hacker News , image from OpenRouter . . . #transformer #openrouter #prompt #models #attention #dataset #llama #meta #llm #agents",
    "timestamp": "2024-09-08T03:30:02.671Z",
    "matched_at": "2025-03-16T14:03:06.299300"
  },
  {
    "id": "7289568319664246785",
    "author": "dan***err***-sm******",
    "content": "The most influential climate leader right now? This is the woman taking on the $1 billion swindle. Introducing Laura Clarke OBE , the CEO of ClientEarth . This law firm represents just ONE CLIENT: 🌍 The Earth. Their latest case targets the world's largest asset manager. BlackRock. This case is crucial, because it is rewriting the playbook for holding corporations accountable. BlackRock represents over $11.5 trillion. But it has, allegedly, been misleading investors: ❌ Labelling certain investment funds as 'sustainable', ❌ while holding significant investments in fossil fuels. BlackRock’s sustainable funds have invested over $1 billion in major fossil fuel companies, including: BP, Shell, Chevron, ExxonMobil, TotalEnergies. The case aims to hold BlackRock accountable for its investment practices and prompt a broader industry shift toward genuine, sustainable investment strategies. This isn’t ClientEarth’s first rodeo. They’ve already: ✅ Blocked illegal logging to protect endangered forests worldwide. ✅ Taken the UK government to court over illegal air pollution levels. And won. ✅ Secured a landmark ruling against the European Investment Bank for evading environmental scrutiny. Laura’s message is loud and clear: business as usual is over. The stakes couldn’t be higher; for BlackRock, for the planet, and for all of us. Here’s to leaders like Laura and teams like ClientEarth who remind us that bold action is possible. Who is an inspiring leader for you in this space? ♻️ Repost this to help your network Follow Dan Sherrard-Smith for more",
    "timestamp": "2025-01-27T09:02:01.015Z",
    "matched_at": "2025-03-16T14:03:06.299301"
  },
  {
    "id": "7284435722621624321",
    "author": "alt***r",
    "content": "This essential article by Anthropic is one of my top favorites, you have to read this if you want to build Agentic AI solutions. https://lnkd.in/difAKJ5Y #AI",
    "timestamp": "2025-01-13T05:06:54.515Z",
    "matched_at": "2025-03-16T14:03:06.299302"
  },
  {
    "id": "7292059618703269888",
    "author": "ros***nya***-bo*********",
    "content": "Starting your week with financial clarity is the best decision you can make for your business. As a business owner, there are a million things on your to-do list, but there's one thing that you can’t afford to overlook, your financial health. Whether you’re a solopreneur, a small business owner, or just starting to scale, maintaining clean, organized financial records is the backbone of any successful business. And that’s where I come in. Here’s how I can help YOU achieve financial clarity and business growth; 1️⃣Precise Record-Keeping Keep track of every financial transaction and ensure that no expense or income slips through the cracks. 2️⃣Bank Reconciliation Matching your books with your bank statements to detect and resolve any discrepancies quickly. 3️⃣Accounts Payable & Receivable Management: I’ll help you stay on top of payments, ensuring you avoid late fees and never miss an opportunity to collect what’s owed. 4️⃣Financial Statements: Clear, concise reports that help you understand your business's financial position at a glance, so you can make informed decisions. 5️⃣Tax Filing & Compliance: I’ll guide you through the complexities of tax regulations, making sure you're compliant and avoiding penalties. 6️⃣Financial Planning & Budgeting: Together, we’ll create a roadmap for your business’s financial future, so you can forecast and plan for growth. ✅When your finances are in order, you can focus on what really matters, growing your business. When you partner with me, you're not just hiring a bookkeeper, you're gaining a financial partner who understands your goals and works tirelessly to help you achieve them. Reach out to me for a free consultation via the DM or use the link on my Bio. I am Rose Onyango a remote Bookkeeper and Accountant at Romich Bookkeeping Solutions -where every number has a story to tell. #Bookkeeping #FinancialClarity #Accounting #BusinessSuccess #Entrepreneurship #SmallBusiness #Growth",
    "timestamp": "2025-02-03T06:01:32.979Z",
    "matched_at": "2025-03-16T14:03:06.299303"
  },
  {
    "id": "7211297173777350656",
    "author": "art***vak***ins******",
    "content": "🎼 𝗠𝗮𝗲𝘀𝘁𝗿𝗼 — 𝗔𝗻 𝗔𝗜 𝗢𝗿𝗰𝗵𝗲𝘀𝘁𝗿𝗮 𝗼𝗳 𝗔𝗱𝘃𝗮𝗻𝗰𝗲𝗱 𝗠𝗼𝗱𝗲𝗹𝘀 🤖 A Python script that employs up to three AI models: A powerful combination of GPT-4o, Claude-3.5, and LlaMa 3 working together to solve your problems. The models' roles are: 🧠 Orchestrator model - manages the entire process. It takes your prompt, breaks it into smaller tasks, and passes them to the next model. 🦾 Sub-agent model- performs key project functions, such as writing code, generating text, and more. 🔎 Refiner model - optimizes and improves the results of previous models, fixes errors, makes text more natural, and more. As Andrew Ng predicted, we see more and more agenic use cases of LLMs these days. Maestro is a perfect example of this trend. #ai #machinelearning #deeplearning #artificialintelligence #datascience #opensource",
    "timestamp": "2024-06-25T09:20:25.632Z",
    "matched_at": "2025-03-16T14:03:06.299304"
  },
  {
    "id": "7241672800334188544",
    "author": "moe***ed",
    "content": "In just a few short years, we’ve witnessed AI models go from supporting tools to potentially surpassing human intelligence. The graph below is a clear testament to this exponential growth, highlighting the leaps AI has made in reasoning and problem-solving capabilities. Take a look at the latest performance benchmarks—models like OpenAI o1 preview and Gemini Advanced are not only reaching human-level intelligence but are beginning to exceed it. The trajectory is undeniable: these models are becoming faster, smarter, and more versatile with each iteration. Here are a few key trends driving this shift: • AI is mastering multi-modal intelligence: Models like GPT-4 Omni (Vision) and Gemini Advanced (Vision) are breaking barriers by integrating language understanding with advanced vision capabilities, challenging the human brain’s ability to process diverse information. • Surpassing human-level reasoning: AI models are no longer just following predefined logic; they’re demonstrating reasoning abilities that often outperform humans in certain tasks. • Exponential learning curves: The speed at which AI models like Claude-3.5 Sonnet and Llama-3.1 are evolving is staggering. With continuous learning, their ability to solve complex problems is outpacing human adaptability. At this rate, AI won’t just be an assistant to human intelligence; it may soon outshine our natural cognitive abilities in key areas like decision-making, data analysis, and creative problem solving. We are standing at the edge of a new era where AI could be driving some of the most critical decisions in industries, research, and even our daily lives. Are we ready for a future where AI surpasses human intelligence? What are the ethical and societal implications? #AI #ArtificialIntelligence #FutureOfAI #LLM Image source: TrackingAI",
    "timestamp": "2024-09-17T05:02:19.340Z",
    "matched_at": "2025-03-16T14:03:06.299304"
  },
  {
    "id": "7206160266265325568",
    "author": "zou***a-k***a",
    "content": "My article, 𝑯𝒐𝒘 𝒕𝒐 𝑪𝒉𝒂𝒕 𝑾𝒊𝒕𝒉 𝑨𝒏𝒚 𝑷𝑫𝑭𝒔 𝒂𝒏𝒅 𝑰𝒎𝒂𝒈𝒆 𝑭𝒊𝒍𝒆𝒔 𝑼𝒔𝒊𝒏𝒈 𝑳𝒂𝒓𝒈𝒆 𝑳𝒂𝒏𝒈𝒖𝒂𝒈𝒆 𝑴𝒐𝒅𝒆𝒍 has been featured as the TOP NOTCH choice by Towards Data Science ! 🌟 This article is suitable for anyone who wants to gain hands-on experience working with Large Language Models (LLMs). The link to the article is in the comment section. The step-by-step video guidance is below as well. Additionally, I'm starting a 28-week challenge focused on AI, Data Science, and Tech in July on my YouTube Channel. Throughout this challenge, I'll cover the following topics: 🔸 Basic Machine Learning 🔸 Linear Algebra 🔸 Machine Learning in Depth 🔸 Deep Learning 🔸 Large Language Models 🔸 AWS Cloud Concepts Throughout this challenge, I'll walk you through hands-on use cases to help you stay updated on these rapidly evolving fields. Follow me and subscribe to my channel to stay updated on the latest content and join me on this 28-week journey. 🌍 Video tutorial: https://lnkd.in/gbpFEKHX ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ I share ML/ Data Science/ AI articles and tips on a regular basis with my LinkedIn family. Follow Zoumana , activate the 🔔 under my profile! #datascience #machinelearning #artificialintelligence #llms #technology #education #largelanguagemodels #nlp #nlproc #opensource #langchain #openai #aws #cloud #youtubechallenge",
    "timestamp": "2024-06-11T05:08:11.429Z",
    "matched_at": "2025-03-16T14:03:06.299305"
  },
  {
    "id": "7224642063378661376",
    "author": "tou***pon***",
    "content": "🚀 Google has just unveiled Gemma 2 2B, a compact yet powerful AI model that rivals industry giants! Despite its smaller size, it’s making waves in the AI community. 🌊 🔑 Key Takeaways: ・ ⚡ Performance: Scores 1130 in LMSYS evaluation, outperforming GPT-3.5-Turbo-0613 and Mixtral-8x7B. ・ 📱 Efficiency: Perfect for on-device applications, revolutionizing mobile AI and edge computing. ・ 🌍 Environmental Impact: Reduces computational requirements, addressing environmental concerns. ・ 🔓 Open Source: Available on Hugging Face via Gradio, supporting PyTorch and TensorFlow. This breakthrough shows that sophisticated training techniques and efficient architectures can rival even the largest models. 🌟 #generativeai #gemma #llm #machinelearning",
    "timestamp": "2024-08-01T05:08:15.238Z",
    "matched_at": "2025-03-16T14:03:06.299306"
  },
  {
    "id": "7281336632627150848",
    "author": "sta***is-***los*********",
    "content": "Evidently AI has done it again! Following their hands-on tutorial on ML observability through their in-house library, they have now released a no-code course that emphasizes the importance of LLM observability in AI-based products. In recent months, I have been involved in similar projects, exploring literature, technical blogs, and open-source solutions on concepts like \"LLM-as-a-judge\" and performance metrics for such use cases. Elena Samuylova 's course highlights several key aspects and benefits of this approach, both from a business and technical perspective. The materials presented here encompass all the necessary components and theoretical underpinnings required to commence your journey. If I had to highlight one phrase, it would be: \"Without evaluations, your proof of concept is just a glorified demo.\" I'm happy to have spent some hours during the holidays on this little gem. https://lnkd.in/dmJkCuEG #evidently #llmasajudge #observability",
    "timestamp": "2025-01-04T15:52:13.887Z",
    "matched_at": "2025-03-16T14:03:06.299307"
  },
  {
    "id": "7282375111188393984",
    "author": "alb***-th***son*********6",
    "content": "🚨 Is Your AI Provider Really Agentic? Here’s 5 insights Google just shared about AI Agents you should know. 🤖 🙋♂️If your AI provider isn’t talking about frameworks like Reasoning and Acting ( #ReAct ), Chain-of-Thought ( #CoT ), or Tree-of-Thoughts (ToT), it’s time to ask a critical question: Do they truly have their own Agentic IP? 🤔 🆔At IDPrivacy AI , we’re not just building models—we’re building agents with real cognitive capabilities. 🧠 Agents are smarter, more adaptive, and the future of AI. Don’t just take our word for it; here are 5 key insights from Google about AI agents that validate why we’re ahead: 1️⃣ Agents are smarter than regular models: They don’t just process—they reason, act, and adapt. This is why we built Agentic AI frameworks that go beyond static models. “Knowledge [in traditional models] is limited to what is available in their training data,” the paper notes. “Agents extend this knowledge through the connection with external systems via tools.” - more 👇 below 2️⃣ Cognitive architecture is key: Smarter agents require an underlying structure. Our architecture integrates reasoning frameworks like ReAct, CoT, and ToT to enable decision-making in real-time, and multi-tool integrations. More below 👇 3️⃣ Tools expand agent reach: Agents become exponentially more powerful with access to knowledge bases, APIs, and data set tools. That’s why we built multi-tool integration to create agents with expansive, actionable intelligence. But they work even better with Advanced RAG and TAG more below 👇 4️⃣ Agentic RAG makes agents better: Retrieval-Augmented Generation (RAG) connects agents to real-time knowledge, making them more precise and versatile. We developed our own Agentic RAG solution to meet these needs. We also built our own natural language 2 sql bringing AI to the quantitative level. 👇 5️⃣ Quantitative AI is the future: Few are talking about TXT2SQL and how it’s redefining quantitative AI to make agents capable of structured data manipulation. We’re leading the charge, building agents that turn raw data into actionable insights and predictive outcomes for real business application. 👍At ID Privacy AI, we aren’t just building frameworks—we’re delivering AI that’s private, scalable & tailored to enterprise needs. 🚀 From private AI infrastructure to RAG-driven AI agents, our solutions redefine how businesses think about AI So, is your vendor truly Agentic, or are they just offering glorified models? 🤷♂️ #AI #AgenticAI #ReAct #ChainOfThought #TreeOfThoughts #Innovation #PrivacyFirstAI #TXT2SQL #RAG #IDPrivacyAI Share: Muaz Maqbool Jared Biggs George W. Moses Nguyen Dario Amodei Aidan Gomez Pat Grady Vijay Pandey Richard Wong Mamoon Hamid Ravi Mhatre Aman Kumar alison harding Jay Turo John Abacahin Brian Lam Tom Ghosh CEA, MSc, MBA Bill Eager Allison Schiff https://lnkd.in/e4Cv6kxF",
    "timestamp": "2025-01-07T12:38:46.460Z",
    "matched_at": "2025-03-16T14:03:06.299307"
  },
  {
    "id": "7201575244250103808",
    "author": "nat***rcy***",
    "content": "Sharing a great article written by Zapier on AI agents. What are they... When are they coming... What should you expect... Here is a quick summary below but I advise reading the full article and researching AI agents. Quick answers: ♦︎ What are AI agents? AI agents are AI designed to perform tasks autonomously. They use AI technologies like machine learning and natural language processing to understand instructions and execute tasks across various applications, such as managing data, automating workflows, coding, and handling customer interactions. ♦︎ When are AI agents coming? AI agents are already available and are continuously being developed. Platforms like Zapier have introduced AI agents that can be used today to automate numerous tasks across thousands of applications. You can also design your own using open-source LLMs. ♦︎ Should I expect AI agents to impact my work? Yes, AI agents are likely to impact your work by automating routine tasks, enhancing productivity, and allowing you to focus on more strategic activities. They are particularly useful in areas such as customer support, data management, and project management, where they can handle repetitive and time-consuming tasks efficiently Key Points: ♦︎ Definition: AI agents are intelligent bots that can automate tasks across different applications, making use of machine learning and natural language processing to understand and execute commands. ♦︎ Capabilities: AI agents can connect to thousands of apps, automate workflows, and access live data to perform tasks in real-time. ♦︎ Current Status: AI agents are already here and are continually being improved. Zapier has launched experimental tools like Zapier Central to allow users to build and train their AI agents for specific tasks. You can also build AI agents on your own with open-source LLM models. ♦︎ Applications: These agents can be used in various fields such as marketing, customer support, app/web coding, and project management to streamline operations and save time. ♦︎ Jobs: The technology behind AI agents is expected to significantly impact the job market by displacing certain jobs and introducing new changes. Although the exact timing and nature of these changes are uncertain, AI agents may replace human workers in various industries. However, this shift will also create new roles focused on AI development, maintenance, and management. *The current estimate by the World Economic Forum is 85M jobs displaced with 97M new/upskilled jobs created. 📄 Link to the full article in the comments below. ---------- 💡 If you would like to learn more about AI agents from experts I recommend connecting with the AI WIZARDS at WANDS AI . WANDS provides fractional AI support from Fortune 500 business leaders and universities' including Chief AI Officers, AI Engineers, AI Ethicists, AI Researchers, and more.",
    "timestamp": "2024-05-29T13:28:56.995Z",
    "matched_at": "2025-03-16T14:03:06.299308"
  },
  {
    "id": "7216292260768862209",
    "author": "iam***yan***",
    "content": "Greetings, Imagine a team of AI assistants working together! This concept, called agentic workflows, involves AI agents collaborating to tackle tasks. It's seen as a potential path towards AGI (Artificial General Intelligence) – machines with human-like intelligence. Current AI is like a single tool. Agentic workflows introduce a team approach, where multiple AI agents work together in stages. Need a report written? Your AI team could handle research, writing, and review, all with your input or there can be a reviewer agent. This interactive collaboration could lead to groundbreaking results! Researchers are also working on faster AI communication to further empower these AI teams. Introducing CHATDEV ( Communicative Agents for Software Development ) automating software development cycle. Checkout https://lnkd.in/dmWfrHNZ #MachineLearning #DeepLearning #NLP #LLM #MAS #CHATDEV",
    "timestamp": "2024-07-09T04:09:07.169Z",
    "matched_at": "2025-03-16T14:03:06.299309"
  },
  {
    "id": "7223927936460939264",
    "author": "har***tja***al",
    "content": "The Hugging Face Open-Source AI Cookbook is a comprehensive resource featuring practical notebooks for building AI applications. It covers a range of topics, including language models, computer vision, and multimodal recipes. The cookbook is community-driven, allowing users to contribute and expand the collection. It includes tutorials like \"Building RAG with Custom Unstructured Data\" and \"Agentic RAG\" for advanced ML techniques. Thanks to Merve Noyan for sharing these amazing recipes and cookbook for learning! Link in comments.",
    "timestamp": "2024-07-30T05:50:34.109Z",
    "matched_at": "2025-03-16T14:03:06.299310"
  },
  {
    "id": "7284762402301054976",
    "author": "ind***eel***e",
    "content": "𝗧𝗵𝗲 𝗡𝗲𝘅𝘁 𝗖𝗵𝗮𝗽𝘁𝗲𝗿 𝗼𝗳 𝗔𝗜: 𝗙𝗿𝗼𝗺 𝗙𝗮𝘀𝘁 𝗧𝗵𝗶𝗻𝗸𝗶𝗻𝗴 𝘁𝗼 𝗗𝗲𝗲𝗽 𝗥𝗲𝗮𝘀𝗼𝗻𝗶𝗻𝗴 We're at an exciting crossroads in the world of AI, and the article from Sequoia Capital, \"Generative AI's Act 01: The Reasoning Era Begins,\" does an excellent job of illustrating this shift. 𝗪𝗵𝗮𝘁’𝘀 𝘁𝗵𝗲 𝗕𝗶𝗴 𝗜𝗱𝗲𝗮? AI is maturing. We're transitioning from quick, pattern-based responses—referred to as System 1 thinking—to a more deliberate and thoughtful approach known as System 2 reasoning. Imagine an AI that not only reacts but also takes a moment to analyze, reason, and solve problems creatively. This isn't merely an upgrade; it's a fundamentally new understanding of what AI can achieve. At SimpleWorks , this concept resonates deeply with our mission. Our R-YaBot, powered by retrieval-augmented generation (RAG), already provides fast, accurate answers based on enterprise data. However, we're not stopping there. We are actively working on incorporating agentic reasoning, allowing our AI to assist businesses in navigating complex workflows and decision-making processes. Think of it as evolving from a helpful assistant into a true collaborator. 𝗪𝗵𝗮𝘁 𝗦𝘁𝗼𝗼𝗱 𝗢𝘂𝘁 𝘁𝗼 𝗠𝗲: 1. 𝗠𝗶𝗺𝗶𝗰𝗿𝘆 𝗜𝘀𝗻’𝘁 𝘁𝗵𝗲 𝗘𝗻𝗱𝗴𝗮𝗺𝗲 Currently, much of AI excels at imitation—predicting the next word, move, or action based on training data. However, tackling substantial problems in math, biology, or enterprise operations requires more time to think, analyze, and solve problems. That's where System 2 thinking comes into play. 2. 𝗔𝗜 𝗜𝘀𝗻’𝘁 𝗝𝘂𝘀𝘁 𝗦𝗼𝗳𝘁𝘄𝗮𝗿𝗲 𝗔𝗻𝘆𝗺𝗼𝗿𝗲 The shift to \"Service-as-a-Software\" is transformative. Imagine paying not for a tool but a result, such as resolving a customer query or completing a process. This shift opens up trillions of dollars worth of opportunities in the services market. 3. 𝗧𝗵𝗲 𝗠𝗲𝘀𝘀𝘆 𝗥𝗲𝗮𝗹 𝗪𝗼𝗿𝗹𝗱 𝗶𝘀 𝘁𝗵𝗲 𝗣𝗿𝗶𝘇𝗲 Enterprises cannot rely on black-box models that provide answers without explanation. Many consumers often stare at a blank prompt, unsure what to ask. This is where the application layer becomes crucial—developing intuitive, reliable tools designed to solve specific real-world problems. 4. 𝗪𝗵𝘆 𝗖𝗼𝗴𝗻𝗶𝘁𝗶𝘃𝗲 𝗔𝗿𝗰𝗵𝗶𝘁𝗲𝗰𝘁𝘂𝗿𝗲𝘀 𝗠𝗮𝘁𝘁𝗲𝗿 The article emphasizes that AI companies need more than just an attractive interface. The value comes from combining multiple models, RAG systems, compliance guardrails, and workflows that align with human thought processes. It's about creating AI that operates the way humans think. 5. 𝗧𝗵𝗲 𝗟𝗼𝗻𝗴 𝗚𝗮𝗺𝗲 This part is particularly thought-provoking: What could happen when AI models can contemplate for hours, days, or even decades? Could we address some of humanity's most complex challenges or solve long-standing mysteries? It's exciting—and somewhat humbling—to imagine what lies ahead. https://lnkd.in/dgsjSBEC #AgenticAI #TechLeadership #SimpleCRM",
    "timestamp": "2025-01-14T02:45:01.019Z",
    "matched_at": "2025-03-16T14:03:06.299310"
  },
  {
    "id": "7259307357648658432",
    "author": "sin***ris***",
    "content": "Large Language Models (LLMs) have undeniably revolutionized the AI landscape. They've shown impressive capabilities in generating text, translating languages, writing different kinds of creative content, and answering your questions in an informative way. As the technology has maturing and becoming more accessible, the focus is shifting from the model itself to its practical applications. The LLMs have become more powerful, they've also become more commoditized. Many models, developed by different companies, often showcase similar capabilities. This raises the question: If the core technology is becoming increasingly similar, how can businesses differentiate themselves? The answer is - Innovative Applications. The real value of LLMs lies not in the model itself, but in how it's applied. Businesses that can effectively leverage LLMs to solve real-world problems and create unique user experiences will gain a competitive edge. By focusing on innovative applications, businesses can harness the full potential of LLMs and differentiate themselves in the market. The future of AI lies not just in the development of powerful models, but in their effective deployment to solve real-world problems. You don't have to come up with a completely new idea for AI usage however you can enhance existing applications by leveraging AI capabilities. Here is an example of Google Meet, how it's using GenAI capabilities to take meeting notes, summarize them. I would not be surprised if based on meeting content, it can create followup meeting invites, add tasks, set reminders and much more. Let's identify simple problems in existing applications and see how GenAI can solve them. #LLMs #genai #applications #generativeai #ai #artificialintelligence",
    "timestamp": "2024-11-04T20:55:45.444Z",
    "matched_at": "2025-03-16T14:03:06.299311"
  },
  {
    "id": "7244708182835560449",
    "author": "ros***-cr***ey-*********424***",
    "content": "Excited to announce an upcoming webinar on implementing Local Large Language Models (LLMs) with real-life insights and use cases! Join me and Daniel Niiaziiev, Head of Engineering at Ralabs, to explore how LLMs can revolutionize your organization. 🧠 What you will learn: - Discover real-life use cases of Local LLMs - Gain insights into LLM implementation - Learn about examples saving 30-40% in operational costs - Understand strategies to avoid common pitfalls and financial risks Ideal for tech decision-makers venturing into AI solutions. Stay ahead in the AI-driven landscape by registering now! #AI #MachineLearning #CTO #LLM #GenerativeAI #TechInnovation #Webinar #TechTalk Register here: https://bit.ly/4gpIS2i",
    "timestamp": "2024-09-25T14:03:50.924Z",
    "matched_at": "2025-03-16T14:03:06.299312"
  },
  {
    "id": "7223150178684256257",
    "author": "gag***eep***a-b*********",
    "content": "🎉 I'm excited to share that I'll be speaking at the GRC ISACA 2024 Conference in Austin, Texas on August 13 from 11:00 am to 12:00 pm CDT. 📅 During my presentation, I will discuss the complex training and adaptation process of Large Language Models (LLMs), from pretraining to adaptation strategies. We will dive deep into Adaptation Strategies such as Fine-Tuning, Prompt Engineering, and Retrieval-Augmented Generation (RAG). 🔍 Additionally, we'll explore diverse applications of LLMs across various industries. I'd be delighted if you could join me and engage in the conversation. 🙌 #AI #MachineLearning #LLMs #GenerativeAI #Transformers #DataScience #ArtificialIntelligence #ML #DeepLearning #DataScientist #AIEngineer #naturallanguageprocessing #appliedscience #NLP #GenAI #LargeLanguageModels",
    "timestamp": "2024-07-28T02:20:02.209Z",
    "matched_at": "2025-03-16T14:03:06.299313"
  },
  {
    "id": "7282357615756496897",
    "author": "ram***des***",
    "content": "Top 5 Headless CMS Platforms to Check Out in 2025! 🔥 Headless CMS platforms are changing the way we build modern applications. They allow you to build a backend where you can manage content in one place and deliver it anywhere—your website, app, or even a smartwatch—using APIs. Imagine building your backend without writing complex server-side code. With a headless CMS, you can create flexible, scalable applications while using any tech stack for the frontend and consuming data effortlessly via API calls instead of relying on a traditional backend. Here are the Top 5 headless CMS platforms to use in 2025: --- 1️⃣ Wix Studio Headless CMS: Wix Studio 's Headless CMS empowers developers with seamless content management and delivery via APIs. It’s perfect for building dynamic applications with modern frontends like React or Vue. In the demo video below, I showcase how easy it is to fetch and display data using Wix Studio’s Headless CMS, making it a powerful choice for scalable, flexible projects. --- 2️⃣ Strapi: A favorite among developers for its flexibility and self-hosted, open-source nature. Strapi lets you customize everything and works seamlessly with modern frameworks. --- 3️⃣ Contentful: A scalable, API-first CMS perfect for managing content across multiple channels. Contentful is ideal for large projects where reliability and performance matter. --- 4️⃣ Sanity: With schema-based models and live collaboration, Sanity is built for teams managing dynamic applications. Its real-time editing capabilities make it a joy to use. --- 5️⃣ Prismic: Prismic simplifies content management with its reusable \"slices\" for faster development. Perfect for blogs, marketing websites, or any project with frequent updates. --- Why Go Headless in 2025? ✔️ Build a backend without writing complex server-side code ✔️ Deliver content anywhere ✔️ Total control over the frontend I personally prefer Wix Studio and Strapi because of their unique strengths, but the others are definitely worth exploring—they each have their own use cases and can shine depending on your project needs. Which headless CMS are you excited to try in 2025? Let me know below! 👇 #wixstudiopartner #headlesscms #cms #wixstudio #reactjs #javascript",
    "timestamp": "2025-01-07T11:29:15.240Z",
    "matched_at": "2025-03-16T14:03:06.299314"
  },
  {
    "id": "7188566059803631616",
    "author": "zee***n-a***di",
    "content": "Large Language Models with External Knowledge Imagine 🤔🧠! You have a super-smart assistant who tackles any task. But, sometimes their knowledge might be limited. And, here Retrieval-Augmented Generation (RAG) helps bridge this gap by allowing large language models (LLMs) to access and leverage information from external sources before generating text. Let's see how it works: 1) User Input ↳ You provide a prompt for the LLM 2) Retrieval ↳ The LLM uses this prompt to search for relevant information in the knowledge base (VectorDB). 3) Augmentation ↳ The LLM combines the retrieved information with its internal knowledge. 4) Generation ↳ Finally, the LLM uses this combined knowledge to generate a more accurate and informative response. It allows these powerful models to go beyond simple text generation but accurate text generation. #AI #MachineLearning #LLMs #RAG #Innovation #Learning",
    "timestamp": "2024-04-23T15:55:05.738Z",
    "matched_at": "2025-03-16T14:03:06.299314"
  },
  {
    "id": "7201822167196454912",
    "author": "ras***d-a***lka*********61a***",
    "content": "RAG(Retrieval Augmented Generation)- I know you have seen this acronym many times on the internet, I think it's very important to distill what RAG means and why we talk about RAG in LLM(Large Language Model). Do you know datacentric AI sometimes hallucinates? Yes, they do when its dealing with much complex prompts from users. Again what does it look like when you say AI hallucinates? AI, especially LLM models like #GPT , #mistra and other large language model systems were trained with large amounts of data from the internet, their responses indexed so many responses for a simple but complex question/prompt. In this case, you may see more than 5 responses for just one prompt because the LLM wasn't sure of the best answer, this is a disadvantage to critical cases like hospital patient chatbots. So let's quickly dive into RAG, RAG allows ML engineers to build LLM AI with their content, it's not a model, it's just an architecture, and its a very simple architecture- you can simply call it your knowledge base LLM. RAG helps you define how your LLM AI responds to users in a well-defined and specific way. This in turn helps with LLM accuracy. How does RAG work? For any institution, you need to prepare your data(it could be a repository of research, conversations, reports, product reviews, ticket responses from customer support, engineering solution documentation, tutorial documents etc). ✍ Your data will be chunked(I wrote about chunks and token in my last post) into sentences, paragraphs, words- this is very easy this days, you can easily read up on many different ways LangChain or Hugging Face . Chunking data makes it easier for your LLM to be well-trained and retrieve specific information in response to prompts. ✍ Your chunks will be embedded into a vector(a simple mathematics vector of numbers)- this could be confusing for non-data experts or people with math-phobia but do not worry about this just understand the concept. ✍ Lastly you introduce any LLM prompt engineering model to define how your response is fed to users with new questions. This is the simplest process of RAG, it could be more complex in cases where you need to fine-tune your model. As users of AI or LLM products out there, you may need to try it out and see how AI hallucinates by just providing a prompt that's probably not easy to find on the internet- you will get the gist better. AI could be better with #RAG ... Jerry Liu explained this in one of his podcasts. #rag #llm #AI #artificialintelligence #linkedin #aws #azure #datascience #data #gpt #gemini #task #chunks #embedding #ai #knowledgebase #gitex #fintune #model #modelgeneration #retrievalaugmentedgeneration #africa #internet #ml #mlengineering #mlresearch #foundation #nlp #transformer #predictions #googleai",
    "timestamp": "2024-05-30T05:50:07.997Z",
    "matched_at": "2025-03-16T14:03:06.299315"
  },
  {
    "id": "7176375865981763584",
    "author": "nes***zle***",
    "content": "In an era where artificial intelligence (AI) shapes the fabric of our daily lives and occupies my mind incessantly as a #FemaleFounderinAI , Dr. Fei-Fei Li's memoir, \"The Worlds I See,\" emerges not just as a narrative of technological innovation but as a beacon of human resilience, diversity, and ethical responsibility. As a female scientist in the predominantly male-dominated field of AI, Dr. Li's journey is nothing short of #inspirational . Her memoir intricately weaves the tale of her #immigration from China to the United States, highlighting the challenges and triumphs of navigating a new country and culture. This aspect of her story resonates deeply with me, as it is showcasing the strength and determination required to pursue one's dreams against all odds. Dr. Li's contributions to AI, most notably the creation of #ImageNet , have been pivotal in ushering in the current era of deep learning. However, \"The Worlds I See\" delves beyond her scientific achievements, offering a deeply personal look into the life of a woman who dared to dream big. Her story is a testament to the power of #curiosity , #exploration , and #discovery , driving home the point that #innovation is not just about #technology but about the people behind it. \"The Worlds I See\" is more than a memoir; it's a blueprint for future generations of scientists and founders, especially women and immigrants, illustrating that with #passion and #perseverance , barriers can be broken, and new frontiers can be explored. Dr. Li's story is a powerful reminder that in the quest to unlock the mysteries of AI, our greatest resource is our shared humanity. I'd like to share this quote as it highly resonates with me: “In the real world, there’s one North Star — Polaris, the brightest in the Ursa Minor constellation. But in the mind, such navigational guides are limitless. Each new pursuit,—each new obsession — hangs in the dark over its horizon, another gleaming trace of iridescence, beckoning. That’s why my greatest joy comes from knowing that this journey will never be complete. Neither will I. There will always be something new to chase. To a scientist, the imagination is a sky full of North Stars.\" I’m glad I read this book when I truly decided to start my #founder journey. I think the book spoke to me a lot as a #FemaleFounder as much as it spoke to my fellow #FemaleScientists ! Fei-Fei Li Thanks for being the inspiration for all of us, #FemaleScientists as well as #FemaleFounders ! I wish having many more #NorthStars in the future! #AI #WomenInSTEM #DiversityInTech #innovation #dreamBig #determination #grit #persistence #HumanCenteredAI #TheWorldsISee #FeiFeiLi",
    "timestamp": "2024-03-21T00:35:36.997Z",
    "matched_at": "2025-03-16T14:03:06.299316"
  }
]